Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
/**************************************************************************//**
 * @file     rtl8735b_sport.c
 * @brief    This file implements the SPORT HAL functions in ROM.
 *
 * @version  V1.00
 * @date     2016-07-20
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b_sport.h"
#include "hal_cache.h"
#include "hal_sys_ctrl.h"
#include "hal_sys_ctrl_nsc.h"

#if !defined(CONFIG_BUILD_NONSECURE)

#undef SPORT_REG_BASE
#define SPORT_REG_BASE (SPORT_S_BASE)

#else

#undef SPORT_REG_BASE
#define SPORT_REG_BASE (SPORT_BASE)

#endif


/**
  * @brief The global common data structure to store common resource
  *        for SPORT adapters.
  */
hal_sport_group_adapter_t sport_group_adapter;

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_sport_rom_func SPORT HAL ROM APIs.
 * @ingroup hs_hal_sport
 * @{
 * @brief The SPORT HAL ROM APIs. The user application(in RAM space) should not call these APIs directly.
 *        There is another set of SPORT HAL APIs in the RAM space is provided for the user application.
 */

/**
  * @brief The stubs functions table to exports SPORT HAL functions in ROM.
  */
const hal_sport_func_stubs_t hal_sport_stubs = {
	.hal_sport_irqhandler_ram = hal_rtl_sport_irqhandler_ram,
	.hal_sport_irq_reg = hal_rtl_sport_irq_reg,
	.hal_sport_irq_unreg = hal_rtl_sport_irq_unreg,
	.hal_sport_init = hal_rtl_sport_init,
	.hal_sport_deinit = hal_rtl_sport_deinit,
	.hal_sport_reset = hal_rtl_sport_reset,
	.hal_sport_reset_tx_fifo = hal_rtl_sport_reset_tx_fifo,
	.hal_sport_reset_rx_fifo = hal_rtl_sport_reset_rx_fifo,
	.hal_sport_bclk_reset = hal_rtl_sport_bclk_reset,
	.hal_sport_dma_reset = hal_rtl_sport_dma_reset,
	.hal_sport_clean_tx_page_own = hal_rtl_sport_clean_tx_page_own,
	.hal_sport_clean_rx_page_own = hal_rtl_sport_clean_rx_page_own,
	.hal_sport_set_master = hal_rtl_sport_set_master,
	.hal_sport_set_loopback = hal_rtl_sport_set_loopback,
	.hal_sport_mode = hal_rtl_sport_mode,
	.hal_sport_tx_ch = hal_rtl_sport_tx_ch,
	.hal_sport_rx_ch = hal_rtl_sport_rx_ch,
	.hal_sport_format = hal_rtl_sport_format,
	.hal_sport_rx_same_format = hal_rtl_sport_rx_same_format,
	.hal_sport_rx_format = hal_rtl_sport_rx_format,
	.hal_sport_tx0_mono = hal_rtl_sport_tx0_mono,
	.hal_sport_tx1_mono =  hal_rtl_sport_tx1_mono,
	.hal_sport_rx_same_mono_stereo = hal_rtl_sport_rx_same_mono_stereo,
	.hal_sport_rx0_mono = hal_rtl_sport_rx0_mono,
	.hal_sport_rx1_mono = hal_rtl_sport_rx1_mono,
	.hal_sport_tx0_data_length = hal_rtl_sport_tx0_data_length,
	.hal_sport_tx1_data_length = hal_rtl_sport_tx1_data_length,
	.hal_sport_rx_same_data_length = hal_rtl_sport_rx_same_data_length,
	.hal_sport_rx0_data_length = hal_rtl_sport_rx0_data_length,
	.hal_sport_rx1_data_length = hal_rtl_sport_rx1_data_length,
	.hal_sport_tx_channel_length = hal_rtl_sport_tx_channel_length,
	.hal_sport_rx_same_channel_length = hal_rtl_sport_rx_same_channel_length,
	.hal_sport_rx_channel_length = hal_rtl_sport_rx_channel_length,
	.hal_sport_tx_rate = hal_rtl_sport_tx_rate,
	.hal_sport_rx_rate = hal_rtl_sport_rx_rate,
	.hal_sport_tx_data_dir = hal_rtl_sport_tx_data_dir,
	.hal_sport_rx_data_dir = hal_rtl_sport_rx_data_dir,
	.hal_sport_tx_lr_swap = hal_rtl_sport_tx_lr_swap,
	.hal_sport_rx_lr_swap = hal_rtl_sport_rx_lr_swap,
	.hal_sport_tx_byte_swap = hal_rtl_sport_tx_byte_swap,
	.hal_sport_rx_byte_swap = hal_rtl_sport_rx_byte_swap,
	.hal_sport_bclk_inverse = hal_rtl_sport_bclk_inverse,
	.hal_sport_set_mclk = hal_rtl_sport_set_mclk,
	.hal_sport_sel_tx_tdm = hal_rtl_sport_sel_tx_tdm,
	.hal_sport_sel_rx_tdm = hal_rtl_sport_sel_rx_tdm,
	.hal_sport_set_tx0_consum = hal_rtl_sport_set_tx0_consum,
	.hal_sport_set_tx1_consum = hal_rtl_sport_set_tx1_consum,
	.hal_sport_set_rx0_consum = hal_rtl_sport_set_rx0_consum,
	.hal_sport_set_rx1_consum = hal_rtl_sport_set_rx1_consum,
	.hal_sport_tx_fifo_0 = hal_rtl_sport_tx_fifo_0,
	.hal_sport_tx_fifo_1 = hal_rtl_sport_tx_fifo_1,
	.hal_sport_rx_fifo_0 = hal_rtl_sport_rx_fifo_0,
	.hal_sport_rx_fifo_1 = hal_rtl_sport_rx_fifo_1,
	.hal_sport_set_tx_lrck = hal_rtl_sport_set_tx_lrck,
	.hal_sport_set_rx_lrck = hal_rtl_sport_set_rx_lrck,
	.hal_sport_tx_params = hal_rtl_sport_tx_params,
	.hal_sport_rx_params = hal_rtl_sport_rx_params,
	.hal_sport_tx_fifo_th = hal_rtl_sport_tx_fifo_th,
	.hal_sport_rx_fifo_th = hal_rtl_sport_rx_fifo_th,
	.hal_sport_set_dma_burst = hal_rtl_sport_set_dma_burst,
	.hal_sport_autoload_dma_burst = hal_rtl_sport_autoload_dma_burst,
	.hal_sport_set_dma_intr = hal_rtl_sport_set_dma_intr,
	.hal_sport_set_tx_fifo_intr = hal_rtl_sport_set_tx_fifo_intr,
	.hal_sport_set_rx_fifo_intr = hal_rtl_sport_set_rx_fifo_intr,
	.hal_sport_dma_params = hal_rtl_sport_dma_params,
	.hal_sport_tx_start = hal_rtl_sport_tx_start,
	.hal_sport_rx_start = hal_rtl_sport_rx_start,
	.hal_sport_tx_dma_start = hal_rtl_sport_tx_dma_start,
	.hal_sport_get_tx_dma_start_sta = hal_rtl_sport_get_tx_dma_start_sta,
	.hal_sport_rx_dma_start = hal_rtl_sport_rx_dma_start,
	.hal_sport_get_rx_dma_start_sta = hal_rtl_sport_get_rx_dma_start_sta,
	.hal_sport_dma_buffer = hal_rtl_sport_dma_buffer,
	.hal_sport_get_tx0_page = hal_rtl_sport_get_tx0_page,
	.hal_sport_get_tx1_page = hal_rtl_sport_get_tx1_page,
	.hal_sport_tx0_page_send = hal_rtl_sport_tx0_page_send,
	.hal_sport_tx1_page_send = hal_rtl_sport_tx1_page_send,
	.hal_sport_rx0_page_recv = hal_rtl_sport_rx0_page_recv,
	.hal_sport_rx1_page_recv = hal_rtl_sport_rx1_page_recv,
	.hal_sport_get_tx_fifo_err = hal_rtl_sport_get_tx_fifo_err,
	.hal_sport_get_rx_fifo_err = hal_rtl_sport_get_rx_fifo_err,
	.hal_sport_clr_tx_fifo_err = hal_rtl_sport_clr_tx_fifo_err,
	.hal_sport_clr_rx_fifo_err = hal_rtl_sport_clr_rx_fifo_err,
	.hal_sport_fifo_cb_handler = hal_rtl_sport_fifo_cb_handler,
	.hal_sport_tx0_dma_cb_handler = hal_rtl_sport_tx0_dma_cb_handler,
	.hal_sport_tx1_dma_cb_handler = hal_rtl_sport_tx1_dma_cb_handler,
	.hal_sport_rx0_dma_cb_handler = hal_rtl_sport_rx0_dma_cb_handler,
	.hal_sport_rx1_dma_cb_handler = hal_rtl_sport_rx1_dma_cb_handler,
	.hal_sport_dma_err_cb_handler = hal_rtl_sport_dma_err_cb_handler,
	.hal_sport_fixed_bclk = hal_rtl_sport_fixed_bclk,
	.hal_sport_rx_same_fs = hal_rtl_sport_rx_same_fs
};

/**
 *  @brief This is the common interrupt handler for SPORT.
 *         It read the system register to know the interrupt event
 *         is triggered by which SPORT device.
 *
 *  @returns void
 */
void hal_rtl_sport_irqhandler_ram(void)
{
	hal_sport_adapter_t *psport_adapter;
	SPORT_TypeDef *psport_reg;

	uint32_t i;
	uint32_t sp_tx_err_sta, sp_rx_err_sta;
	uint32_t sp_tx0_dma_int_sta, sp_tx1_dma_int_sta;
	uint32_t sp_rx0_dma_int_sta, sp_rx1_dma_int_sta;
	uint32_t sp_tx0_dma_int_sta_err, sp_tx1_dma_int_sta_err;
	uint32_t sp_rx0_dma_int_sta_err, sp_rx1_dma_int_sta_err;
	uint32_t sp_page_num;
	uint32_t sport_tx0_intr_event, sport_tx1_intr_event;
	uint32_t sport_rx0_intr_event, sport_rx1_intr_event;
	hal_sport_init_dat_t *psport_init_dat;
	uint32_t pbuf;

