Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
	hal_irq_clear_pending(SPORT_IRQn);

	psport_adapter = sport_group_adapter.psport_adapter[SPORT_id];

	psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	//dbg_printf("SPORT_IRQHandler \r\n");

	if (psport_adapter->sport_mode_record == SPORT_FIFO_MODE) {

		//FIFO mode : Input callback function
		if (psport_adapter->sport_irq_user_cb != NULL) {
			psport_adapter->sport_irq_user_cb(psport_adapter->sport_user_arg, NULL);
		}

	} else {

		psport_init_dat = &psport_adapter->init_dat;

		sp_tx_err_sta = hal_rtl_sport_get_tx_fifo_err(psport_adapter);
		sp_rx_err_sta = hal_rtl_sport_get_rx_fifo_err(psport_adapter);

		if ((sp_tx_err_sta != 0x00) || (sp_rx_err_sta != 0x00)) {
			//dbg_printf("sp_tx_err_sta: %d \r\n", sp_tx_err_sta);
			//dbg_printf("sp_rx_err_sta: %d \r\n", sp_rx_err_sta);
		}

		sp_tx0_dma_int_sta = hal_rtl_sport_get_tx0_dma_intr(psport_adapter);
		sp_tx1_dma_int_sta = hal_rtl_sport_get_tx1_dma_intr(psport_adapter);
		sp_rx0_dma_int_sta = hal_rtl_sport_get_rx0_dma_intr(psport_adapter);
		sp_rx1_dma_int_sta = hal_rtl_sport_get_rx1_dma_intr(psport_adapter);

		sp_tx0_dma_int_sta_err = hal_rtl_sport_get_tx0_dma_err_intr(psport_adapter);
		sp_tx1_dma_int_sta_err = hal_rtl_sport_get_tx1_dma_err_intr(psport_adapter);
		sp_rx0_dma_int_sta_err = hal_rtl_sport_get_rx0_dma_err_intr(psport_adapter);
		sp_rx1_dma_int_sta_err = hal_rtl_sport_get_rx1_dma_err_intr(psport_adapter);

		psport_adapter->tx_fifo_err = sp_tx_err_sta;
		psport_adapter->rx_fifo_err = sp_rx_err_sta;
		psport_adapter->tx0_dma_err = sp_tx0_dma_int_sta_err;
		psport_adapter->tx1_dma_err = sp_tx1_dma_int_sta_err;
		psport_adapter->rx0_dma_err = sp_rx0_dma_int_sta_err;
		psport_adapter->rx1_dma_err = sp_rx1_dma_int_sta_err;

		if (sp_tx0_dma_int_sta_err != 0x00) {
			DBG_SPORT_ERR("sp_tx0_dma_int_sta_err: 0x%8x \r\n", sp_tx0_dma_int_sta_err);
			hal_rtl_sport_tx_dma_start(psport_adapter, DISABLE);
			hal_rtl_sport_rx_dma_start(psport_adapter, DISABLE);
			hal_rtl_sport_clr_tx0_dma_intr(psport_adapter);
			psport_adapter->dma_err_sta |= 0x01;
		}

		if (sp_tx1_dma_int_sta_err != 0x00) {
			DBG_SPORT_ERR("sp_tx1_dma_int_sta_err: 0x%8x \r\n", sp_tx1_dma_int_sta_err);
			hal_rtl_sport_tx_dma_start(psport_adapter, DISABLE);
			hal_rtl_sport_rx_dma_start(psport_adapter, DISABLE);
			hal_rtl_sport_clr_tx1_dma_intr(psport_adapter);
			psport_adapter->dma_err_sta |= 0x02;
		}

		if (sp_rx0_dma_int_sta_err != 0x00) {
			DBG_SPORT_ERR("sp_rx0_dma_int_sta_err: 0x%8x \r\n", sp_rx0_dma_int_sta_err);
			hal_rtl_sport_tx_dma_start(psport_adapter, DISABLE);
			hal_rtl_sport_rx_dma_start(psport_adapter, DISABLE);
			hal_rtl_sport_clr_rx0_dma_intr(psport_adapter);
			psport_adapter->dma_err_sta |= 0x04;
		}

		if (sp_rx1_dma_int_sta_err != 0x00) {
			DBG_SPORT_ERR("sp_rx1_dma_int_sta_err: 0x%8x \r\n", sp_rx1_dma_int_sta_err);
			hal_rtl_sport_tx_dma_start(psport_adapter, DISABLE);
			hal_rtl_sport_rx_dma_start(psport_adapter, DISABLE);
			hal_rtl_sport_clr_rx1_dma_intr(psport_adapter);
			psport_adapter->dma_err_sta |= 0x08;
		}

		if (psport_adapter->dma_err_sta != 0x00) {
			if (psport_adapter->sport_dma_err_irq_user_cb != NULL) {
				psport_adapter->sport_dma_err_irq_user_cb(psport_adapter->sport_dma_err_user_arg, &psport_adapter->dma_err_sta);
			}
		}

		sp_page_num = hal_rtl_sport_get_page_number(psport_adapter) + 1;

		for (i = 0; i < sp_page_num; i++) { // page 0, 1, 2, 3

			sport_tx0_intr_event = sp_tx0_dma_int_sta & (1 << psport_init_dat->sport_hw_tx0_idx);

			if (sport_tx0_intr_event != 0x00) {
				pbuf = (u32)psport_adapter->ptx0_page_list[psport_init_dat->sport_hw_tx0_idx];

				//--------TX0 Data Process-----------

				if (psport_adapter->sport_tx0_irq_user_cb != NULL) {
					psport_adapter->sport_tx0_irq_user_cb(psport_adapter->sport_tx0_user_arg, (u8 *)pbuf);
				}

				//--------TX0 Data Process End--------

				hal_rtl_sport_clr_tx0_page_intr(psport_adapter, sport_tx0_intr_event);
				sp_tx0_dma_int_sta &= ~(sport_tx0_intr_event);
				psport_init_dat->sport_hw_tx0_idx += 1;
				if (psport_init_dat->sport_hw_tx0_idx == sp_page_num) {
					psport_init_dat->sport_hw_tx0_idx = 0;
				}
			}

			sport_tx1_intr_event = sp_tx1_dma_int_sta & (1 << psport_init_dat->sport_hw_tx1_idx);

			if (sport_tx1_intr_event != 0x00) {
				pbuf = (u32)psport_adapter->ptx1_page_list[psport_init_dat->sport_hw_tx1_idx];

				//--------TX1 Data Process-----------

				if (psport_adapter->sport_tx1_irq_user_cb != NULL) {
					psport_adapter->sport_tx1_irq_user_cb(psport_adapter->sport_tx1_user_arg, (u8 *)pbuf);
				}

				//--------TX1 Data Process End--------

				hal_rtl_sport_clr_tx1_page_intr(psport_adapter, sport_tx1_intr_event);
				sp_tx1_dma_int_sta &= ~(sport_tx1_intr_event);
				psport_init_dat->sport_hw_tx1_idx += 1;
				if (psport_init_dat->sport_hw_tx1_idx == sp_page_num) {
					psport_init_dat->sport_hw_tx1_idx = 0;
				}
			}

			sport_rx0_intr_event = sp_rx0_dma_int_sta & (1 << psport_init_dat->sport_hw_rx0_idx);

			if (sport_rx0_intr_event != 0x00) {
				pbuf = (u32)psport_adapter->prx0_page_list[psport_init_dat->sport_hw_rx0_idx];

				//--------RX0 Data Process-----------

				if (psport_adapter->dcache_memory_en == 1) {
					if (psport_adapter->dcache_invalidate_by_addr != NULL) {
						// D-Cache sync (Invalidate)
						psport_adapter->dcache_invalidate_by_addr((uint32_t *)pbuf,
								(int32_t)((((psport_reg->SPORT_SP_DMA_CON & SPORT_MASK_SP_PAGE_SIZE) >> SPORT_SHIFT_SP_PAGE_SIZE) + 1) << 2));
					} else {
						DBG_SPORT_ERR(" psport_adapter->dcache_invalidate_by_addr is null \r\n");
					}
				}

				if (psport_adapter->sport_rx0_irq_user_cb != NULL) {
					psport_adapter->sport_rx0_irq_user_cb(psport_adapter->sport_rx0_user_arg, (u8 *)pbuf);
				}

				//--------RX0 Data Process End--------

				hal_rtl_sport_clr_rx0_page_intr(psport_adapter, sport_rx0_intr_event);
				sp_rx0_dma_int_sta &= ~(sport_rx0_intr_event);
				psport_init_dat->sport_hw_rx0_idx += 1;
				if (psport_init_dat->sport_hw_rx0_idx == sp_page_num) {
					psport_init_dat->sport_hw_rx0_idx = 0;
				}
			}

			sport_rx1_intr_event = sp_rx1_dma_int_sta & (1 << psport_init_dat->sport_hw_rx1_idx);

