Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
			if (sport_rx1_intr_event != 0x00) {
				pbuf = (u32)psport_adapter->prx1_page_list[psport_init_dat->sport_hw_rx1_idx];

				//--------RX1 Data Process-----------

				if (psport_adapter->dcache_memory_en == 1) {
					if (psport_adapter->dcache_invalidate_by_addr != NULL) {
						// D-Cache sync (Invalidate)
						psport_adapter->dcache_invalidate_by_addr((uint32_t *)pbuf,
								(int32_t)((((psport_reg->SPORT_SP_DMA_CON & SPORT_MASK_SP_PAGE_SIZE) >> SPORT_SHIFT_SP_PAGE_SIZE) + 1) << 2));
					} else {
						DBG_SPORT_ERR(" psport_adapter->dcache_invalidate_by_addr is null \r\n");
					}
				}

				if (psport_adapter->sport_rx1_irq_user_cb != NULL) {
					psport_adapter->sport_rx1_irq_user_cb(psport_adapter->sport_rx1_user_arg, (u8 *)pbuf);
				}

				//--------RX1 Data Process End--------

				hal_rtl_sport_clr_rx1_page_intr(psport_adapter, sport_rx1_intr_event);
				sp_rx1_dma_int_sta &= ~(sport_rx1_intr_event);
				psport_init_dat->sport_hw_rx1_idx += 1;
				if (psport_init_dat->sport_hw_rx1_idx == sp_page_num) {
					psport_init_dat->sport_hw_rx1_idx = 0;
				}
			}

		}

	}

}

/**
 *  @brief To register a IRQ handler for SPORT.
 *
 *  @returns void
 */
void hal_rtl_sport_irq_reg(void)
{
	hal_irq_disable(SPORT_IRQn);
	__ISB();

	// Register SPORT common IRQ handler
	hal_irq_set_vector(SPORT_IRQn, (uint32_t)hal_rtl_sport_irqhandler_ram);
	hal_irq_clear_pending(SPORT_IRQn);
	hal_irq_enable(SPORT_IRQn);
}

/**
 *  @brief To un-register the SPORT IRQ handler.
 *
 *  @returns void
 */
void hal_rtl_sport_irq_unreg(void)
{
	// No any SPORT port has IRQ handler, so disable the common interrupt
	hal_irq_disable(SPORT_IRQn);
	__ISB();
}


/**
 *  @brief Initialize the SPORT hardware and turn on the SPORT
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @return     HAL_ERR_PARA
 *  @return     HAL_OK
 */
HAL_Status hal_rtl_sport_init(hal_sport_adapter_t *psport_adapter)
{
	uint8_t i;

	//Check if SPORT has been registered.
	for (i = 0; i < SPORT_Max_Id; i++) {
		if (sport_group_adapter.psport_adapter[i] != NULL) {
			DBG_SPORT_WARN("The sport had been registered. \r\n");
			break;
		}
	}

	hal_rtl_sport_irq_reg();

	//Set IRQ priority
	hal_irq_set_priority(SPORT_IRQn, SPORT_IRQPri);

	psport_adapter->base_addr = (SPORT_Type *)SPORT_REG_BASE;

	sport_group_adapter.psport_adapter[SPORT_id] = psport_adapter;

	//hal_rtl_sys_sport_src_sel(SPORT_40MHZ);
	hal_sys_set_clk(SPORT_SYS, SPORT_40MHZ);

	hal_sys_peripheral_en(SPORT_SYS, ENABLE);

	//Reg dcache app
	psport_adapter->dcache_clean_by_addr = hal_cache_stubs.dcache_clean_by_addr;
	psport_adapter->dcache_invalidate_by_addr = hal_cache_stubs.dcache_invalidate_by_addr;

	//Initial
	psport_adapter->tx_channel_factor = 1;
	psport_adapter->rx_channel_factor = 1;
	psport_adapter->dma_err_sta = 0x00;
	psport_adapter->dcache_memory_en = 1;

	hal_rtl_sport_reset(psport_adapter);

	return 0;

}

/**
 *  @brief De-initialize of the SPORT hardware and turn off the SPORT.
 *
 *  @param[in] pecdsa_adapter The SPORT adapter.
 *
 *  @return     HAL_ERR_PARA
 *  @return     HAL_OK
 */
HAL_Status hal_rtl_sport_deinit(hal_sport_adapter_t *psport_adapter)
{
	if (psport_adapter == 0) {
		DBG_SPORT_WARN("hal_rtl_sport_deinit: Null Pointer\r\n");
		return HAL_ERR_PARA;
	}

	hal_rtl_sport_reset(psport_adapter);

	/*SPORT Interrupt DeInitialization*/
	hal_rtl_sport_irq_unreg();

	hal_sys_peripheral_en(SPORT_SYS, DISABLE);

	sport_group_adapter.psport_adapter[SPORT_id] = NULL;

	return 0;
}

/**
 *  @brief Reset the SPORT module.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_reset(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_adapter->init_dat.sport_tx0_idx = 0x00;
	psport_adapter->init_dat.sport_rx0_idx = 0x00;
	psport_adapter->init_dat.sport_tx1_idx = 0x00;
	psport_adapter->init_dat.sport_rx1_idx = 0x00;
	psport_adapter->init_dat.sport_hw_tx0_idx = 0x00;
	psport_adapter->init_dat.sport_hw_rx0_idx = 0x00;
	psport_adapter->init_dat.sport_hw_tx1_idx = 0x00;
	psport_adapter->init_dat.sport_hw_rx1_idx = 0x00;
	psport_adapter->dma_err_sta = 0x00;

	psport_reg->SPORT_SP_CON |= SPORT_BIT_SP_RESET;
	psport_reg->SPORT_SP_CON &= ~(SPORT_BIT_SP_RESET);
}

/**
 *  @brief Reset the SPORT TX FIFO.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_reset_tx_fifo(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_EN_CLK_CON |= SPORT_BIT_SP_TX_FIFO_RESET;
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON &= ~(SPORT_BIT_SP_TX_FIFO_RESET);
}

/**
 *  @brief Reset the SPORT RX FIFO.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_reset_rx_fifo(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_EN_CLK_CON |= SPORT_BIT_SP_RX_FIFO_RESET;
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON &= ~(SPORT_BIT_SP_RX_FIFO_RESET);
}

/**
 *  @brief Reset the SPORT bclk.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_bclk_reset(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_EN_CLK_CON |= SPORT_BIT_SP_BCLK_RESET;
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON &= ~(SPORT_BIT_SP_BCLK_RESET);
}

/**
 *  @brief Reset the SPORT DMA.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_dma_reset(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_DMA_CON &= ~(SPORT_BIT_SP_DMA_RSTN);
	psport_reg->SPORT_SP_DMA_CON |= SPORT_BIT_SP_DMA_RSTN;
}

/**
 *  @brief Clean the SPORT TX page own.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_clean_tx_page_own(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_TX_PAGE_OWN = 0x00;
}

/**
 *  @brief Clean the SPORT RX page own.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_clean_rx_page_own(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

