Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
	psport_reg->SPORT_SP_RX_PAGE_OWN = 0x00;
}

/**
 *  @brief  Set the master or slave mode.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] dev_mode Select the master or slave mode.
 *
 *  @returns void
 */
void hal_rtl_sport_set_master(hal_sport_adapter_t *psport_adapter, sport_dev_mode_t dev_mode)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_SLAVE_DATA_SEL);
	temp_reg |= (dev_mode << SPORT_SHIFT_SP_SLAVE_DATA_SEL);
	psport_reg->SPORT_SP_CON = temp_reg;
}

/**
 *  @brief Control the SPORT loopback mode.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] loopback_en  Enable control: 0 is disable, 1 is enable.
 *
 *  @returns void
 */
void hal_rtl_sport_set_loopback(hal_sport_adapter_t *psport_adapter, BOOL loopback_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_LOOPBACK);
	temp_reg |= (loopback_en << SPORT_SHIFT_SP_LOOPBACK);
	psport_reg->SPORT_SP_CON = temp_reg;
}

/**
 *  @brief  Set the DMA or FIFO mode.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] wk_mode Select the DMA or FIFO mode.
 *
 *  @returns void
 */
void hal_rtl_sport_mode(hal_sport_adapter_t *psport_adapter, sport_wk_mode_t wk_mode)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	psport_adapter->sport_mode_record = wk_mode;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_MCU_CTL_MODE);
	temp_reg |= (wk_mode << SPORT_SHIFT_SP_MCU_CTL_MODE);
	psport_reg->SPORT_SP_CON = temp_reg;
}

/**
 *  @brief Control the tx data format of the sport. Don't support the TDM mode.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_sel_ch  Set the relation between the data and channel.
 *                      -00: L/R.
 *                      -01: R/L.
 *                      -10: L/L.
 *                      -11: R/R.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_ch(hal_sport_adapter_t *psport_adapter, sport_sel_ch_t sport_sel_ch)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_MASK_SP_SEL_I2S_TX_CH);
	temp_reg |= (sport_sel_ch << SPORT_SHIFT_SP_SEL_I2S_TX_CH);
	psport_reg->SPORT_SP_CON = temp_reg;
}

/**
 *  @brief Control the rx data format of the sport. Don't support the TDM mode.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_sel_ch  Set the relation between the data and channel.
 *                      -00: L/R.
 *                      -01: R/L.
 *                      -10: L/L.
 *                      -11: R/R.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_ch(hal_sport_adapter_t *psport_adapter, sport_sel_ch_t sport_sel_ch)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_MASK_SP_SEL_I2S_RX_CH);
	temp_reg |= (sport_sel_ch << SPORT_SHIFT_SP_SEL_I2S_RX_CH);
	psport_reg->SPORT_SP_CON = temp_reg;
}

/**
 *  @brief Set the format of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_format  Select the interface format.
 *
 *  @returns void
 */
void hal_rtl_sport_format(hal_sport_adapter_t *psport_adapter, sport_format_t sport_format)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_MASK_SP_DATA_FORMAT_SEL_TX);
	temp_reg |= (sport_format << SPORT_SHIFT_SP_DATA_FORMAT_SEL_TX);
	psport_reg->SPORT_SP_CON = temp_reg;
}

/**
 *  @brief Set tx and rx are the same format. Only support I2S and PCM_A format.
 *         The sample rate clock of SD_I is according to LRCK_RX. Need to set rx rate.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx_en 1: Tx and rx are the same, 0: Need to set rx format and rate.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_same_format(hal_sport_adapter_t *psport_adapter, BOOL rx_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_TRX_SAME_FS);
	temp_reg |= (rx_en << SPORT_SHIFT_SP_TRX_SAME_FS);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}

/**
 *  @brief Set the rx format of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_format  Select the interface format.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_format(hal_sport_adapter_t *psport_adapter, sport_format_t sport_format)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_MASK_SP_DATA_FORMAT_SEL_RX);
	temp_reg |= (sport_format << SPORT_SHIFT_SP_DATA_FORMAT_SEL_RX);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}


/**
 *  @brief Select tx0 mono or stereo of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] type_sel  Select the mono and stereo. 0:stereo, 1:mono
 *
 *  @returns void
 */
void hal_rtl_sport_tx0_mono(hal_sport_adapter_t *psport_adapter, BOOL type_sel)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_EN_I2S_MONO_TX_0);
	temp_reg |= (type_sel << SPORT_SHIFT_SP_EN_I2S_MONO_TX_0);
	psport_reg->SPORT_SP_CON = temp_reg;
}

/**
 *  @brief Select tx1 mono or stereo of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] type_sel  Select the mono and stereo. 0:stereo, 1:mono
 *
 *  @returns void
 */
void hal_rtl_sport_tx1_mono(hal_sport_adapter_t *psport_adapter, BOOL type_sel)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_EN_I2S_MONO_TX_1);
	temp_reg |= (type_sel << SPORT_SHIFT_SP_EN_I2S_MONO_TX_1);
	psport_reg->SPORT_SP_TX1_RX1_FORM_CON = temp_reg;
}

/**
 *  @brief Set tx and rx are the same mono or stereo type .
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx_en 1: Tx and rx are the same, 0: Need to set rx.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_same_mono_stereo(hal_sport_adapter_t *psport_adapter, BOOL rx_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

