Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_TRX_SAME_CH);
	temp_reg |= (rx_en << SPORT_SHIFT_SP_TRX_SAME_CH);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}

/**
 *  @brief Select rx0 mono or stereo of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] type_sel  Select the mono and stereo. 0:stereo, 1:mono
 *
 *  @returns void
 */
void hal_rtl_sport_rx0_mono(hal_sport_adapter_t *psport_adapter, BOOL type_sel)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_EN_I2S_MONO_RX_0);
	temp_reg |= (type_sel << SPORT_SHIFT_SP_EN_I2S_MONO_RX_0);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}

/**
 *  @brief Select rx1 mono or stereo of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] type_sel  Select the mono and stereo. 0:stereo, 1:mono
 *
 *  @returns void
 */
void hal_rtl_sport_rx1_mono(hal_sport_adapter_t *psport_adapter, BOOL type_sel)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_EN_I2S_MONO_RX_1);
	temp_reg |= (type_sel << SPORT_SHIFT_SP_EN_I2S_MONO_RX_1);
	psport_reg->SPORT_SP_TX1_RX1_FORM_CON = temp_reg;
}

/**
 *  @brief Select tx0 data length of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] dl  Select the data length.
 *
 *  @returns void
 */
void hal_rtl_sport_tx0_data_length(hal_sport_adapter_t *psport_adapter, sport_dl_t dl)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_MASK_SP_DATA_LEN_SEL_TX_0);
	temp_reg |= (dl << SPORT_SHIFT_SP_DATA_LEN_SEL_TX_0);
	psport_reg->SPORT_SP_CON = temp_reg;
}

/**
 *  @brief Select tx1 data length of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] dl  Select the data length.
 *
 *  @returns void
 */
void hal_rtl_sport_tx1_data_length(hal_sport_adapter_t *psport_adapter, sport_dl_t dl)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_FORM_CON;
	temp_reg &= ~(SPORT_MASK_SP_DATA_LEN_SEL_TX_1);
	temp_reg |= (dl << SPORT_SHIFT_SP_DATA_LEN_SEL_TX_1);
	psport_reg->SPORT_SP_TX1_RX1_FORM_CON = temp_reg;
}

/**
 *  @brief Set tx and rx are the same data length .
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx_en 1: Tx and rx are the same, 0: Need to set rx.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_same_data_length(hal_sport_adapter_t *psport_adapter, BOOL rx_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_TRX_SAME_LENGTH);
	temp_reg |= (rx_en << SPORT_SHIFT_SP_TRX_SAME_LENGTH);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}

/**
 *  @brief Select rx0 data length of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] dl  Select the data length.
 *
 *  @returns void
 */
void hal_rtl_sport_rx0_data_length(hal_sport_adapter_t *psport_adapter, sport_dl_t dl)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_MASK_SP_DATA_LEN_SEL_RX_0);
	temp_reg |= (dl << SPORT_SHIFT_SP_DATA_LEN_SEL_RX_0);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}

/**
 *  @brief Select rx1 data length of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] dl  Select the data length.
 *
 *  @returns void
 */
void hal_rtl_sport_rx1_data_length(hal_sport_adapter_t *psport_adapter, sport_dl_t dl)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_FORM_CON;
	temp_reg &= ~(SPORT_MASK_SP_DATA_LEN_SEL_RX_1);
	temp_reg |= (dl << SPORT_SHIFT_SP_DATA_LEN_SEL_RX_1);
	psport_reg->SPORT_SP_TX1_RX1_FORM_CON = temp_reg;
}

/**
 *  @brief Select tx channel length of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] dl  Select the channel length.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_channel_length(hal_sport_adapter_t *psport_adapter, sport_cl_t cl)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_MASK_SP_CH_LEN_SEL_TX);
	temp_reg |= (cl << SPORT_SHIFT_SP_CH_LEN_SEL_TX);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}

/**
 *  @brief Set tx and rx are the same channel length .
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx_en 1 Tx and rx are the same, 0: Need to set rx.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_same_channel_length(hal_sport_adapter_t *psport_adapter, BOOL rx_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_TRX_SAME_CH_LEN);
	temp_reg |= (rx_en << SPORT_SHIFT_SP_TRX_SAME_CH_LEN);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}

/**
 *  @brief Select rx channel length of the SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] dl  Select the channel length.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_channel_length(hal_sport_adapter_t *psport_adapter, sport_cl_t cl)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_MASK_SP_CH_LEN_SEL_RX);
	temp_reg |= (cl << SPORT_SHIFT_SP_CH_LEN_SEL_RX);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}

/**
 *  @brief Set the sport tx rate.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_sample_rate  Sample rate.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_rate(hal_sport_adapter_t *psport_adapter, sport_rate_t sport_sample_rate)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;
	u32 mi = 625;
	u32 ni = 8;

	switch (sport_sample_rate) {

	case R_1KHZ:
		mi = 625;
		ni = 1;
		break;

	case R_4KHZ:
		mi = 625;
		ni = 4;
		break;

	case R_8KHZ:
		mi = 625;
		ni = 8;
		break;

	case R_16KHZ:
		mi = 625;
		ni = 16;
		break;

