Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
	case R_32KHZ:
		mi = 625;
		ni = 32;
		break;

	case R_44p1KHZ:
		mi = 411;
		ni = 29;
		break;

	case R_48KHZ:
		mi = 625;
		ni = 48;
		break;

	case R_88p2KHZ:
		mi = 411;
		ni = 58;
		break;

	case R_96KHZ:
		mi = 625;
		ni = 96;
		break;

	case R_12KHZ:
		mi = 625;
		ni = 12;
		break;

	case R_24KHZ:
		mi = 625;
		ni = 24;
		break;

	case R_192KHZ:
		mi = 625;
		ni = 192;
		break;

	case R_384KHZ:
		mi = 625;
		ni = 384;
		break;

	case R_7p35KHZ:
		mi = 85;
		ni = 1;
		break;

	case R_11p025KHZ:
		mi = 907;
		ni = 16;
		break;

	case R_14p7KHZ:
		mi = 85;
		ni = 2;
		break;

	case R_22p05KHZ:
		mi = 822;
		ni = 29;
		break;

	case R_29p4KHZ:
		mi = 659;
		ni = 31;
		break;

	case R_58p8KHZ:
		mi = 946;
		ni = 89;
		break;

	case R_176p4KHZ:
		mi = 411;
		ni = 116;
		break;

	default :

		break;

	}

	ni = ni * psport_adapter->tx_ch_len_factor;
	mi = mi * 8;

	//temp_reg = psport_reg->SPORT_SP_TX_FRA_DIV;
	//temp_reg &= ~(SPORT_MASK_SP_TX_MI | SPORT_MASK_SP_TX_NI | SPORT_BIT_SP_TX_MI_NI_UPDATE);
	temp_reg = 0x00;
	temp_reg |= (mi << SPORT_SHIFT_SP_TX_MI) | ((ni * psport_adapter->tx_channel_factor) << SPORT_SHIFT_SP_TX_NI);

	psport_reg->SPORT_SP_FIFO_EN_CLK_CON |= SPORT_BIT_SP_BCLK_RESET;
	psport_reg->SPORT_SP_TX_FRA_DIV = temp_reg;
	psport_reg->SPORT_SP_TX_FRA_DIV = (temp_reg | SPORT_BIT_SP_TX_MI_NI_UPDATE);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON &= ~(SPORT_BIT_SP_BCLK_RESET);

}

/**
 *  @brief Set the sport rx rate.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_sample_rate  Sample rate.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_rate(hal_sport_adapter_t *psport_adapter, sport_rate_t sport_sample_rate)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;
	u32 mi = 625;
	u32 ni = 8;

	switch (sport_sample_rate) {

	case R_1KHZ:
		mi = 625;
		ni = 1;
		break;

	case R_4KHZ:
		mi = 625;
		ni = 4;
		break;

	case R_8KHZ:
		mi = 625;
		ni = 8;
		break;

	case R_16KHZ:
		mi = 625;
		ni = 16;
		break;

	case R_32KHZ:
		mi = 625;
		ni = 32;
		break;

	case R_44p1KHZ:
		mi = 411;
		ni = 29;
		break;

	case R_48KHZ:
		mi = 625;
		ni = 48;
		break;

	case R_88p2KHZ:
		mi = 411;
		ni = 58;
		break;

	case R_96KHZ:
		mi = 625;
		ni = 96;
		break;

	case R_12KHZ:
		mi = 625;
		ni = 12;
		break;

	case R_24KHZ:
		mi = 625;
		ni = 24;
		break;

	case R_192KHZ:
		mi = 625;
		ni = 192;
		break;

	case R_384KHZ:
		mi = 625;
		ni = 384;
		break;

	case R_7p35KHZ:
		mi = 85;
		ni = 1;
		break;

	case R_11p025KHZ:
		mi = 907;
		ni = 16;
		break;

	case R_14p7KHZ:
		mi = 85;
		ni = 2;
		break;

	case R_22p05KHZ:
		mi = 822;
		ni = 29;
		break;

	case R_29p4KHZ:
		mi = 659;
		ni = 31;
		break;

	case R_58p8KHZ:
		mi = 946;
		ni = 89;
		break;

	case R_176p4KHZ:
		mi = 411;
		ni = 116;
		break;

	default :

		break;

	}

	ni = ni * psport_adapter->rx_ch_len_factor;
	mi = mi * 8;

	//temp_reg = psport_reg->SPORT_SP_RX_FRA_DIV;
	//temp_reg &= ~(SPORT_MASK_SP_RX_MI | SPORT_MASK_SP_RX_NI | SPORT_BIT_SP_RX_MI_NI_UPDATE);
	temp_reg = 0x00;
	temp_reg |= (mi << SPORT_SHIFT_SP_RX_MI) | ((ni * psport_adapter->rx_channel_factor) << SPORT_SHIFT_SP_RX_NI);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON |= SPORT_BIT_SP_BCLK_RESET;
	psport_reg->SPORT_SP_RX_FRA_DIV = temp_reg;
	psport_reg->SPORT_SP_RX_FRA_DIV = (temp_reg | SPORT_BIT_SP_RX_MI_NI_UPDATE);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON &= ~(SPORT_BIT_SP_BCLK_RESET);

}

/**
 *  @brief Set the MSB or LBS first of tx data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] tx0_ml  Set the MSB or LBS first for FIFO_0.
 *  @param[in] tx1_ml  Set the MSB or LBS first for FIFO_1.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_data_dir(hal_sport_adapter_t *psport_adapter, sport_ml_t tx0_ml, sport_ml_t tx1_ml)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_LSB_FIRST_0);
	temp_reg |= (tx0_ml << SPORT_SHIFT_SP_TX_LSB_FIRST_0);
	psport_reg->SPORT_SP_CON = temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_DAT_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_LSB_FIRST_1);
	temp_reg |= (tx1_ml << SPORT_SHIFT_SP_TX_LSB_FIRST_1);
	psport_reg->SPORT_SP_TX1_RX1_DAT_CON = temp_reg;
}

/**
 *  @brief Set the MSB or LBS first of rx data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx0_ml  Set the MSB or LBS first for FIFO_0.
 *  @param[in] rx1_ml  Set the MSB or LBS first for FIFO_1.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_data_dir(hal_sport_adapter_t *psport_adapter, sport_ml_t rx0_ml, sport_ml_t rx1_ml)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_LSB_FIRST_0);
	temp_reg |= (rx0_ml << SPORT_SHIFT_SP_RX_LSB_FIRST_0);
	psport_reg->SPORT_SP_CON = temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_DAT_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_LSB_FIRST_1);
	temp_reg |= (rx1_ml << SPORT_SHIFT_SP_RX_LSB_FIRST_1);
	psport_reg->SPORT_SP_TX1_RX1_DAT_CON = temp_reg;
}

/**
 *  @brief Swap the L/R of tx data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] tx0_en  Enable the swap for FIFO_0.
 *  @param[in] tx1_en  Enable the swap for FIFO_1.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_lr_swap(hal_sport_adapter_t *psport_adapter, BOOL tx0_en, BOOL tx1_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_EN_CLK_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_SRC_LR_SWAP_0);
	temp_reg |= (tx0_en << SPORT_SHIFT_SP_TX_SRC_LR_SWAP_0);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON = temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_DAT_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_SRC_LR_SWAP_1);
	temp_reg |= (tx1_en << SPORT_SHIFT_SP_TX_SRC_LR_SWAP_1);
	psport_reg->SPORT_SP_TX1_RX1_DAT_CON = temp_reg;
}

/**
 *  @brief Swap the L/R of rx data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx0_en  Enable the swap for FIFO_0.
 *  @param[in] rx1_en  Enable the swap for FIFO_1.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_lr_swap(hal_sport_adapter_t *psport_adapter, BOOL rx0_en, BOOL rx1_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

