Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
	temp_reg = psport_reg->SPORT_SP_FIFO_EN_CLK_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_SNK_LR_SWAP_0);
	temp_reg |= (rx0_en << SPORT_SHIFT_SP_RX_SNK_LR_SWAP_0);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON = temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_DAT_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_SNK_LR_SWAP_1);
	temp_reg |= (rx1_en << SPORT_SHIFT_SP_RX_SNK_LR_SWAP_1);
	psport_reg->SPORT_SP_TX1_RX1_DAT_CON = temp_reg;
}

/**
 *  @brief Swap the byte of tx data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] tx0_en  Enable the swap for FIFO_0.
 *  @param[in] tx1_en  Enable the swap for FIFO_1.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_byte_swap(hal_sport_adapter_t *psport_adapter, BOOL tx0_en, BOOL tx1_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_EN_CLK_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_SRC_BYTE_SWAP_0);
	temp_reg |= (tx0_en << SPORT_SHIFT_SP_TX_SRC_BYTE_SWAP_0);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON = temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_DAT_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_SRC_BYTE_SWAP_1);
	temp_reg |= (tx1_en << SPORT_SHIFT_SP_TX_SRC_BYTE_SWAP_1);
	psport_reg->SPORT_SP_TX1_RX1_DAT_CON = temp_reg;
}

/**
 *  @brief Swap the byte of rx data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx0_en  Enable the swap for FIFO_0.
 *  @param[in] rx1_en  Enable the swap for FIFO_1.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_byte_swap(hal_sport_adapter_t *psport_adapter, BOOL rx0_en, BOOL rx1_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_EN_CLK_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_SNK_BYTE_SWAP_0);
	temp_reg |= (rx0_en << SPORT_SHIFT_SP_RX_SNK_BYTE_SWAP_0);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON = temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_RX1_DAT_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_SNK_BYTE_SWAP_1);
	temp_reg |= (rx1_en << SPORT_SHIFT_SP_RX_SNK_BYTE_SWAP_1);
	psport_reg->SPORT_SP_TX1_RX1_DAT_CON = temp_reg;
}

/**
 *  @brief Set the sport bclk inverse.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] inverse_en  Make bclk inverse.
 *
 *  @returns void
 */
void hal_rtl_sport_bclk_inverse(hal_sport_adapter_t *psport_adapter, BOOL inverse_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_BCLK_OUT_INVERSE);
	temp_reg |= (inverse_en << SPORT_SHIFT_SP_BCLK_OUT_INVERSE);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;

#if 1
	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_INV_I2S_SCLK);
	temp_reg |= (inverse_en << SPORT_SHIFT_SP_INV_I2S_SCLK);
	psport_reg->SPORT_SP_CON = temp_reg;
#else
	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_INV_I2S_SCLK);
	temp_reg |= (inverse_en << SPORT_SHIFT_SP_TX_INV_I2S_SCLK);
	psport_reg->SPORT_SP_CON = temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_INV_I2S_SCLK);
	temp_reg |= (inverse_en << SPORT_SHIFT_SP_RX_INV_I2S_SCLK);
	psport_reg->SPORT_SP_CON = temp_reg;
#endif

}

/**
 *  @brief Set the sport mclk.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_mclk  Select the mclk rate.
 *  @param[in] mclk_en  Enable mclk.
 *
 *  @returns void
 */
void hal_rtl_sport_set_mclk(hal_sport_adapter_t *psport_adapter, sport_mclk_t sport_mclk, BOOL mclk_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_MASK_SP_MCLK_SEL);
	temp_reg |= (sport_mclk << SPORT_SHIFT_SP_MCLK_SEL);
	psport_reg->SPORT_SP_CON = temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_EN_CLK_CON;
	temp_reg &= ~(SPORT_BIT_SP_ENABLE_MCLK);
	temp_reg |= (mclk_en << SPORT_SHIFT_SP_ENABLE_MCLK);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON = temp_reg;

}

/**
 *  @brief Select the sport tx tdm mode
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_tdm  Select the tdm mode.
 *
 *  @returns void
 */
void hal_rtl_sport_sel_tx_tdm(hal_sport_adapter_t *psport_adapter, sport_tdm_t sport_tdm)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_MASK_SP_TDM_MODE_SEL_TX);
	temp_reg |= (sport_tdm << SPORT_SHIFT_SP_TDM_MODE_SEL_TX);
	psport_reg->SPORT_SP_CON = temp_reg;

}

/**
 *  @brief Select the sport rx tdm mode
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_tdm  Select the tdm mode.
 *
 *  @returns void
 */
void hal_rtl_sport_sel_rx_tdm(hal_sport_adapter_t *psport_adapter, sport_tdm_t sport_tdm)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_MASK_SP_TDM_MODE_SEL_RX);
	temp_reg |= (sport_tdm << SPORT_SHIFT_SP_TDM_MODE_SEL_RX);
	psport_reg->SPORT_SP_CON = temp_reg;

}

/**
 *  @brief Set the sport data consumption of TX_FIFO_0
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_layer  Set the number of consumption layers. One layer is 32 bits.
 *
 *  @returns void
 */
void hal_rtl_sport_set_tx0_consum(hal_sport_adapter_t *psport_adapter, u8 sport_layer)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_ERR_CNT_CON;
	temp_reg &= ~(SPORT_MASK_SP_TX_DEPTH_THR_0);
	temp_reg |= (sport_layer << SPORT_SHIFT_SP_TX_DEPTH_THR_0);
	psport_reg->SPORT_SP_ERR_CNT_CON = temp_reg;

}

/**
 *  @brief Set the sport data consumption of TX_FIFO_1
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_layer  Set the number of consumption layers. One layer is 32 bits.
 *
 *  @returns void
 */
void hal_rtl_sport_set_tx1_consum(hal_sport_adapter_t *psport_adapter, u8 sport_layer)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_ERR_CNT_CON;
	temp_reg &= ~(SPORT_MASK_SP_TX_DEPTH_THR_1);
	temp_reg |= (sport_layer << SPORT_SHIFT_SP_TX_DEPTH_THR_1);
	psport_reg->SPORT_SP_ERR_CNT_CON = temp_reg;

