Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
}

/**
 *  @brief Set the sport data consumption of RX_FIFO_0
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_layer  Set the number of consumption layers. One layer is 32 bits.
 *
 *  @returns void
 */
void hal_rtl_sport_set_rx0_consum(hal_sport_adapter_t *psport_adapter, u8 sport_layer)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_ERR_CNT_CON;
	temp_reg &= ~(SPORT_MASK_SP_RX_DEPTH_THR_0);
	temp_reg |= (sport_layer << SPORT_SHIFT_SP_RX_DEPTH_THR_0);
	psport_reg->SPORT_SP_ERR_CNT_CON = temp_reg;

}

/**
 *  @brief Set the sport data consumption of RX_FIFO_1
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] sport_layer  Set the number of consumption layers. One layer is 32 bits.
 *
 *  @returns void
 */
void hal_rtl_sport_set_rx1_consum(hal_sport_adapter_t *psport_adapter, u8 sport_layer)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_ERR_CNT_CON;
	temp_reg &= ~(SPORT_MASK_SP_RX_DEPTH_THR_1);
	temp_reg |= (sport_layer << SPORT_SHIFT_SP_RX_DEPTH_THR_1);
	psport_reg->SPORT_SP_ERR_CNT_CON = temp_reg;

}

/**
 *  @brief Control the sport tx FIFO_0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] ch1ch0_en  Enable channel 0 and 1 data path for FIFO_0.
 *  @param[in] ch2ch3_en  Enable channel 2 and 3 data path for FIFO_0.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_fifo_0(hal_sport_adapter_t *psport_adapter, BOOL ch1ch0_en, BOOL ch2ch3_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_EN_CLK_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_FIFO_0_CH0_1_EN | SPORT_BIT_SP_TX_FIFO_0_CH2_3_EN);
	temp_reg |= (ch1ch0_en << SPORT_SHIFT_SP_TX_FIFO_0_CH0_1_EN) | (ch2ch3_en << SPORT_SHIFT_SP_TX_FIFO_0_CH2_3_EN);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON = temp_reg;

}

/**
 *  @brief Control the sport tx FIFO_1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] ch4ch5_en  Enable channel 4 and 5 data path for FIFO_1.
 *  @param[in] ch6ch7_en  Enable channel 6 and 7 data path for FIFO_1.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_fifo_1(hal_sport_adapter_t *psport_adapter, BOOL ch4ch5_en, BOOL ch6ch7_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_EN_CLK_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_FIFO_1_CH4_5_EN | SPORT_BIT_SP_TX_FIFO_1_CH6_7_EN);
	temp_reg |= (ch4ch5_en << SPORT_SHIFT_SP_TX_FIFO_1_CH4_5_EN) | (ch6ch7_en << SPORT_SHIFT_SP_TX_FIFO_1_CH6_7_EN);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON = temp_reg;

}

/**
 *  @brief Control the sport rx FIFO_0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] ch1ch0_en  Enable channel 0 and 1 data path for FIFO_0.
 *  @param[in] ch2ch3_en  Enable channel 2 and 3 data path for FIFO_0.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_fifo_0(hal_sport_adapter_t *psport_adapter, BOOL ch1ch0_en, BOOL ch2ch3_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_EN_CLK_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_FIFO_0_CH0_1_EN | SPORT_BIT_SP_RX_FIFO_0_CH2_3_EN);
	temp_reg |= (ch1ch0_en << SPORT_SHIFT_SP_RX_FIFO_0_CH0_1_EN) | (ch2ch3_en << SPORT_SHIFT_SP_RX_FIFO_0_CH2_3_EN);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON = temp_reg;

}

/**
 *  @brief Control the sport rx FIFO_1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] ch4ch5_en  Enable channel 4 and 5 data path for FIFO_1.
 *  @param[in] ch6ch7_en  Enable channel 6 and 7 data path for FIFO_1.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_fifo_1(hal_sport_adapter_t *psport_adapter, BOOL ch4ch5_en, BOOL ch6ch7_en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_EN_CLK_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_FIFO_1_CH4_5_EN | SPORT_BIT_SP_RX_FIFO_1_CH6_7_EN);
	temp_reg |= (ch4ch5_en << SPORT_SHIFT_SP_RX_FIFO_1_CH4_5_EN) | (ch6ch7_en << SPORT_SHIFT_SP_RX_FIFO_1_CH6_7_EN);
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON = temp_reg;

}

/**
 *  @brief Set BCLK numbers of one period LRCK for TX.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] bclk_cnt  Set the number of bclks for LRCK.
 *
 *  @returns void
 */
void hal_rtl_sport_set_tx_lrck(hal_sport_adapter_t *psport_adapter, u8 bclk_cnt)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_LRCK_FIFO_TH_CON;
	temp_reg &= ~(SPORT_MASK_SP_BCLK_DIV_RATIO);
	temp_reg |= ((bclk_cnt - 1) << SPORT_SHIFT_SP_BCLK_DIV_RATIO);
	psport_reg->SPORT_SP_LRCK_FIFO_TH_CON = temp_reg;

}

/**
 *  @brief Set BCLK numbers of one period LRCK for RX.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] bclk_cnt  Set the number of bclks for LRCK.
 *
 *  @returns void
 */
void hal_rtl_sport_set_rx_lrck(hal_sport_adapter_t *psport_adapter, u8 bclk_cnt)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_LRCK_FIFO_TH_CON;
	temp_reg &= ~(SPORT_MASK_SP_RX_BCLK_DIV_RATIO);
	temp_reg |= ((bclk_cnt - 1) << SPORT_SHIFT_SP_RX_BCLK_DIV_RATIO);
	psport_reg->SPORT_SP_LRCK_FIFO_TH_CON = temp_reg;

}

/**
 *  @brief Set sport tx parameters.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] psport_tx_params  Set tx parameter inputs.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_params(hal_sport_adapter_t *psport_adapter, hal_sport_tx_params_t *psport_tx_params)
{
	u32 channel_len = 16;
	u32 channel_factor = 1;

	// 0: 16bits, 1: 20bits, 2: 24bits, 4: 32bits
	hal_rtl_sport_tx_channel_length(psport_adapter, psport_tx_params->sport_tx_cl);

	switch (psport_tx_params->sport_tx_cl) {

	case SPORT_CL_16BIT:
		channel_len = 16;
		psport_adapter->tx_ch_len_factor = 4;
		break;

	case SPORT_CL_20BIT:
		channel_len = 20;
		psport_adapter->tx_ch_len_factor = 5;
		break;

	case SPORT_CL_24BIT:
		channel_len = 24;
		psport_adapter->tx_ch_len_factor = 6;
		break;

	case SPORT_CL_32BIT:
		channel_len = 32;
		psport_adapter->tx_ch_len_factor = 8;
		break;

	default :
		DBG_SPORT_ERR("hal_rtl_sport_tx_params, sport_tx_cl is invalid \r\n");
		break;

