Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
	}

	hal_rtl_sport_tx0_data_length(psport_adapter, psport_tx_params->sport_tx0_dl);
	hal_rtl_sport_tx1_data_length(psport_adapter, psport_tx_params->sport_tx1_dl);

	switch (psport_tx_params->sport_tx_ch) {

	case CH_1_MONO:
		hal_rtl_sport_sel_tx_tdm(psport_adapter, SPORT_NO_TDM);
		hal_rtl_sport_tx0_mono(psport_adapter, 1);
		hal_rtl_sport_tx1_mono(psport_adapter, 1);
		hal_rtl_sport_set_tx0_consum(psport_adapter, 1);
		hal_rtl_sport_set_tx1_consum(psport_adapter, 1);
		hal_rtl_sport_tx_fifo_0(psport_adapter, 1, 0);
		hal_rtl_sport_tx_fifo_1(psport_adapter, 0, 0);
		channel_factor = 1;
		break;

	case CH_2_STEREO:
		hal_rtl_sport_sel_tx_tdm(psport_adapter, SPORT_NO_TDM);
		//FIFO 0
		hal_rtl_sport_tx0_mono(psport_adapter, 0);
		if (psport_tx_params->sport_tx0_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_tx0_consum(psport_adapter, 1);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_tx0_consum(psport_adapter, 2);
		}
		hal_rtl_sport_tx_fifo_0(psport_adapter, 1, 0);
		//FIFO 1
		hal_rtl_sport_tx1_mono(psport_adapter, 0);
		if (psport_tx_params->sport_tx1_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_tx1_consum(psport_adapter, 1);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_tx1_consum(psport_adapter, 2);
		}
		hal_rtl_sport_tx_fifo_1(psport_adapter, 0, 0);
		channel_factor = 1;
		break;

	case CH_4:
		hal_rtl_sport_sel_tx_tdm(psport_adapter, SPORT_4_TDM);
		//FIFO 0
		hal_rtl_sport_tx0_mono(psport_adapter, 0);
		if (psport_tx_params->sport_tx0_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_tx0_consum(psport_adapter, 2);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_tx0_consum(psport_adapter, 4);
		}
		hal_rtl_sport_tx_fifo_0(psport_adapter, 1, 1);
		//FIFO 1
		hal_rtl_sport_tx1_mono(psport_adapter, 1);
		if (psport_tx_params->sport_tx1_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_tx1_consum(psport_adapter, 1);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_tx1_consum(psport_adapter, 2);
		}
		hal_rtl_sport_tx_fifo_1(psport_adapter, 0, 0);
		channel_factor = 2;
		break;

	case CH_6:
		hal_rtl_sport_sel_tx_tdm(psport_adapter, SPORT_6_TDM);
		//FIFO 0
		hal_rtl_sport_tx0_mono(psport_adapter, 0);
		if (psport_tx_params->sport_tx0_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_tx0_consum(psport_adapter, 2);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_tx0_consum(psport_adapter, 4);
		}
		hal_rtl_sport_tx_fifo_0(psport_adapter, 1, 1);
		//FIFO 1
		hal_rtl_sport_tx1_mono(psport_adapter, 0);
		if (psport_tx_params->sport_tx1_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_tx1_consum(psport_adapter, 1);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_tx1_consum(psport_adapter, 2);
		}
		hal_rtl_sport_tx_fifo_1(psport_adapter, 1, 0);
		channel_factor = 3;
		break;

	case CH_8:
		hal_rtl_sport_sel_tx_tdm(psport_adapter, SPORT_8_TDM);
		//FIFO 0
		hal_rtl_sport_tx0_mono(psport_adapter, 0);
		if (psport_tx_params->sport_tx0_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_tx0_consum(psport_adapter, 2);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_tx0_consum(psport_adapter, 4);
		}
		hal_rtl_sport_tx_fifo_0(psport_adapter, 1, 1);
		//FIFO 1
		hal_rtl_sport_tx1_mono(psport_adapter, 0);
		if (psport_tx_params->sport_tx1_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_tx1_consum(psport_adapter, 2);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_tx1_consum(psport_adapter, 4);
		}
		hal_rtl_sport_tx_fifo_1(psport_adapter, 1, 1);
		channel_factor = 4;
		break;

	default :
		DBG_SPORT_ERR("hal_rtl_sport_tx_params, sport_tx_ch is invalid \r\n");
		break;

	}

	hal_rtl_sport_set_tx_lrck(psport_adapter, (channel_len * channel_factor * 2));

	psport_adapter->tx_channel_factor = channel_factor;
	hal_rtl_sport_tx_rate(psport_adapter, psport_tx_params->sport_tx_rate);

}

/**
 *  @brief Set sport rx parameters.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] psport_rx_params  Set rx parameter inputs.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_params(hal_sport_adapter_t *psport_adapter, hal_sport_rx_params_t *psport_rx_params)
{
	u32 channel_len = 16;
	u32 channel_factor = 1;

	// 0: 16bits, 1: 20bits, 2: 24bits, 4: 32bits
	hal_rtl_sport_rx_channel_length(psport_adapter, psport_rx_params->sport_rx_cl);

	switch (psport_rx_params->sport_rx_cl) {

	case SPORT_CL_16BIT:
		channel_len = 16;
		psport_adapter->rx_ch_len_factor = 4;
		break;

	case SPORT_CL_20BIT:
		channel_len = 20;
		psport_adapter->rx_ch_len_factor = 5;
		break;

	case SPORT_CL_24BIT:
		channel_len = 24;
		psport_adapter->rx_ch_len_factor = 6;
		break;

	case SPORT_CL_32BIT:
		channel_len = 32;
		psport_adapter->rx_ch_len_factor = 8;
		break;

	default :
		DBG_SPORT_ERR("hal_rtl_sport_rx_params, sport_rx_cl is invalid \r\n");
		break;

	}

	hal_rtl_sport_rx0_data_length(psport_adapter, psport_rx_params->sport_rx0_dl);
	hal_rtl_sport_rx1_data_length(psport_adapter, psport_rx_params->sport_rx1_dl);

	switch (psport_rx_params->sport_rx_ch) {

	case CH_1_MONO:
		hal_rtl_sport_sel_rx_tdm(psport_adapter, SPORT_NO_TDM);
		hal_rtl_sport_rx0_mono(psport_adapter, 1);
		hal_rtl_sport_rx1_mono(psport_adapter, 1);
		hal_rtl_sport_set_rx0_consum(psport_adapter, 1);
		hal_rtl_sport_set_rx1_consum(psport_adapter, 1);
		hal_rtl_sport_rx_fifo_0(psport_adapter, 1, 0);
		hal_rtl_sport_rx_fifo_1(psport_adapter, 0, 0);
		channel_factor = 1;
		break;

	case CH_2_STEREO:
		hal_rtl_sport_sel_rx_tdm(psport_adapter, SPORT_NO_TDM);
		//FIFO 0
		hal_rtl_sport_rx0_mono(psport_adapter, 0);
		if (psport_rx_params->sport_rx0_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_rx0_consum(psport_adapter, 1);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_rx0_consum(psport_adapter, 2);
		}
		hal_rtl_sport_rx_fifo_0(psport_adapter, 1, 0);
		//FIFO 1
		hal_rtl_sport_rx1_mono(psport_adapter, 0);
		if (psport_rx_params->sport_rx1_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_rx1_consum(psport_adapter, 1);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_rx1_consum(psport_adapter, 2);
		}
		hal_rtl_sport_rx_fifo_1(psport_adapter, 0, 0);
		channel_factor = 1;
		break;

	case CH_4:
		hal_rtl_sport_sel_rx_tdm(psport_adapter, SPORT_4_TDM);
		//FIFO 0
		hal_rtl_sport_rx0_mono(psport_adapter, 0);
		if (psport_rx_params->sport_rx0_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_rx0_consum(psport_adapter, 2);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_rx0_consum(psport_adapter, 4);
		}
		hal_rtl_sport_rx_fifo_0(psport_adapter, 1, 1);
		//FIFO 1
		hal_rtl_sport_rx1_mono(psport_adapter, 1);
		if (psport_rx_params->sport_rx1_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_rx1_consum(psport_adapter, 1);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_rx1_consum(psport_adapter, 2);
		}
		hal_rtl_sport_rx_fifo_1(psport_adapter, 0, 0);
		channel_factor = 2;
		break;

