Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
	case CH_6:
		hal_rtl_sport_sel_rx_tdm(psport_adapter, SPORT_6_TDM);
		//FIFO 0
		hal_rtl_sport_rx0_mono(psport_adapter, 0);
		if (psport_rx_params->sport_rx0_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_rx0_consum(psport_adapter, 2);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_rx0_consum(psport_adapter, 4);
		}
		hal_rtl_sport_rx_fifo_0(psport_adapter, 1, 1);
		//FIFO 1
		hal_rtl_sport_rx1_mono(psport_adapter, 0);
		if (psport_rx_params->sport_rx1_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_rx1_consum(psport_adapter, 1);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_rx1_consum(psport_adapter, 2);
		}
		hal_rtl_sport_rx_fifo_1(psport_adapter, 1, 0);
		channel_factor = 3;
		break;

	case CH_8:
		hal_rtl_sport_sel_rx_tdm(psport_adapter, SPORT_8_TDM);
		//FIFO 0
		hal_rtl_sport_rx0_mono(psport_adapter, 0);
		if (psport_rx_params->sport_rx0_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_rx0_consum(psport_adapter, 2);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_rx0_consum(psport_adapter, 4);
		}
		hal_rtl_sport_rx_fifo_0(psport_adapter, 1, 1);
		//FIFO 1
		hal_rtl_sport_rx1_mono(psport_adapter, 0);
		if (psport_rx_params->sport_rx1_dl ==  SPORT_DL_16BIT) {
			// data length = 16bits
			hal_rtl_sport_set_rx1_consum(psport_adapter, 2);
		} else {
			// data length > 16bits
			hal_rtl_sport_set_rx1_consum(psport_adapter, 4);
		}
		hal_rtl_sport_rx_fifo_1(psport_adapter, 1, 1);
		channel_factor = 4;
		break;

	default :
		DBG_SPORT_ERR("hal_rtl_sport_rx_params, sport_rx_ch is invalid \r\n");
		break;

	}

	hal_rtl_sport_set_rx_lrck(psport_adapter, (channel_len * channel_factor * 2));

	psport_adapter->rx_channel_factor = channel_factor;
	hal_rtl_sport_rx_rate(psport_adapter, psport_rx_params->sport_rx_rate);

}


/**
 *  @brief Set TX FIFO interrupt and DMA request threshold.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] tx_th  Set number of tx FIFO threshold.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_fifo_th(hal_sport_adapter_t *psport_adapter, u8 tx_th)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_LRCK_FIFO_TH_CON;
	temp_reg &= ~(SPORT_MASK_SP_TX_FIFO_TH);
	temp_reg |= ((tx_th - 1) << SPORT_SHIFT_SP_TX_FIFO_TH);
	psport_reg->SPORT_SP_LRCK_FIFO_TH_CON = temp_reg;

}

/**
 *  @brief Set RX FIFO interrupt and DMA request threshold.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx_th  Set number of rx FIFO threshold.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_fifo_th(hal_sport_adapter_t *psport_adapter, u8 rx_th)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_LRCK_FIFO_TH_CON;
	temp_reg &= ~(SPORT_MASK_SP_RX_FIFO_TH);
	temp_reg |= ((rx_th - 1) << SPORT_SHIFT_SP_RX_FIFO_TH);
	psport_reg->SPORT_SP_LRCK_FIFO_TH_CON = temp_reg;

}

/**
 *  @brief Set dma burst size.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] burst_size Select the DMA burst size.
 *
 *  @returns void
 */
void hal_rtl_sport_set_dma_burst(hal_sport_adapter_t *psport_adapter, sport_burst_size_t burst_size)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_DMA_CON;
	temp_reg &= ~(SPORT_MASK_SP_BURST_SIZE);
	temp_reg |= (burst_size << SPORT_SHIFT_SP_BURST_SIZE);
	psport_reg->SPORT_SP_DMA_CON = temp_reg;

}

/**
 *  @brief Automatically set dma burst size.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_autoload_dma_burst(hal_sport_adapter_t *psport_adapter)
{
	u8 sp_tx_fifo_th, sp_rx_fifo_th;

	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_LRCK_FIFO_TH_CON;

	sp_tx_fifo_th = (temp_reg & SPORT_MASK_SP_TX_FIFO_TH) >> SPORT_SHIFT_SP_TX_FIFO_TH;
	sp_rx_fifo_th = (temp_reg & SPORT_MASK_SP_RX_FIFO_TH) >> SPORT_SHIFT_SP_RX_FIFO_TH;

	if ((sp_tx_fifo_th == 15) && (sp_rx_fifo_th == 15)) {
		hal_rtl_sport_set_dma_burst(psport_adapter, SPORT_BURST_16);
	} else if ((sp_tx_fifo_th == 7) && (sp_rx_fifo_th == 7)) {
		hal_rtl_sport_set_dma_burst(psport_adapter, SPORT_BURST_8);
	} else if ((sp_tx_fifo_th == 3) && (sp_rx_fifo_th == 3)) {
		hal_rtl_sport_set_dma_burst(psport_adapter, SPORT_BURST_4);
	} else {
		DBG_SPORT_WARN(" hal_sport_autoload_dma_burst: fifo_th doesn't meet burst_size\r\n");
	}

	temp_reg = psport_reg->SPORT_SP_DMA_CON;
	temp_reg &= ~(SPORT_BIT_SP_DMA_CTRL);
	psport_reg->SPORT_SP_DMA_CON = temp_reg;

}

/**
 *  @brief Set DMA interrupts
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] trx Select TX/RX.
 *  @param[in] ppage_intr Set DMA interrupts..
 *
 *  @returns void
 */
void hal_rtl_sport_set_dma_intr(hal_sport_adapter_t *psport_adapter, sport_trx_t trx, hal_sport_page_intr_t *ppage_intr)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg = 0x00;

	temp_reg = (ppage_intr->sport_p0ok << SPORT_SHIFT_SP_TX0_P0OKIE) | (ppage_intr->sport_p1ok << SPORT_SHIFT_SP_TX0_P1OKIE);
	temp_reg |= (ppage_intr->sport_p2ok << SPORT_SHIFT_SP_TX0_P2OKIE) | (ppage_intr->sport_p3ok << SPORT_SHIFT_SP_TX0_P3OKIE);
	temp_reg |= (ppage_intr->sport_p0unava << SPORT_SHIFT_SP_TX0_PAGE0UNAVA_IE) | (ppage_intr->sport_p1unava << SPORT_SHIFT_SP_TX0_PAGE1UNAVA_IE);
	temp_reg |= (ppage_intr->sport_p2unava << SPORT_SHIFT_SP_TX0_PAGE2UNAVA_IE) | (ppage_intr->sport_p3unava << SPORT_SHIFT_SP_TX0_PAGE3UNAVA_IE);
	temp_reg |= (ppage_intr->sport_p0err << SPORT_SHIFT_SP_TX0_PAGE0ERRIE) | (ppage_intr->sport_p1err << SPORT_SHIFT_SP_TX0_PAGE1ERRIE);
	temp_reg |= (ppage_intr->sport_p2err << SPORT_SHIFT_SP_TX0_PAGE2ERRIE) | (ppage_intr->sport_p3err << SPORT_SHIFT_SP_TX0_PAGE3ERRIE);
	temp_reg |= (ppage_intr->sport_fifo_err << SPORT_SHIFT_SP_TX0_UNDERFLOW_IE);

	if (trx == SPORT_TX0) {
		psport_reg->SPORT_SP_TX0_DMA_INT_EN = temp_reg;
	} else if (trx == SPORT_TX1) {
		psport_reg->SPORT_SP_TX1_DMA_INT_EN = temp_reg;
	} else if (trx == SPORT_RX0) {
		psport_reg->SPORT_SP_RX0_DMA_INT_EN = temp_reg;
	} else if (trx == SPORT_RX1) {
		psport_reg->SPORT_SP_RX1_DMA_INT_EN = temp_reg;
	}

