Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
}

/**
 *  @brief Set TX FIFO interrupts
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] ptx_fifo_intr Set TX FIFO interrupts..
 *
 *  @returns void
 */
void hal_rtl_sport_set_tx_fifo_intr(hal_sport_adapter_t *psport_adapter, hal_sport_tx_fifo_intr_t *ptx_fifo_intr)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;

	temp_reg &= ~(SPORT_BIT_SP_TX_IDLE_INTR_1_EN | SPORT_BIT_SP_TX_FIFO_EMPTY_1_EN | SPORT_BIT_SP_TX_FIFO_FULL_INTR_1_EN | SPORT_BIT_SP_TX_FIFO_TH_INTR_1_EN);
	temp_reg &= ~(SPORT_BIT_SP_TX_IDLE_INTR_0_EN | SPORT_BIT_SP_TX_FIFO_EMPTY_0_EN | SPORT_BIT_SP_TX_FIFO_FULL_INTR_0_EN | SPORT_BIT_SP_TX_FIFO_TH_INTR_0_EN);

	temp_reg |= (ptx_fifo_intr->sport_idle_tx1 << SPORT_SHIFT_SP_TX_IDLE_INTR_1_EN);
	temp_reg |= (ptx_fifo_intr->sport_empty_tx1 << SPORT_SHIFT_SP_TX_FIFO_EMPTY_1_EN);
	temp_reg |= (ptx_fifo_intr->sport_full_tx1 << SPORT_SHIFT_SP_TX_FIFO_FULL_INTR_1_EN);
	temp_reg |= (ptx_fifo_intr->sport_th_tx1 << SPORT_SHIFT_SP_TX_FIFO_TH_INTR_1_EN);

	temp_reg |= (ptx_fifo_intr->sport_idle_tx0 << SPORT_SHIFT_SP_TX_IDLE_INTR_0_EN);
	temp_reg |= (ptx_fifo_intr->sport_empty_tx0 << SPORT_SHIFT_SP_TX_FIFO_EMPTY_0_EN);
	temp_reg |= (ptx_fifo_intr->sport_full_tx0 << SPORT_SHIFT_SP_TX_FIFO_FULL_INTR_0_EN);
	temp_reg |= (ptx_fifo_intr->sport_th_tx0 << SPORT_SHIFT_SP_TX_FIFO_TH_INTR_0_EN);

	psport_reg->SPORT_SP_FIFO_INTR_CON = temp_reg;

}

/**
 *  @brief Set RX FIFO interrupts
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] prx_fifo_intr Set RX FIFO interrupts..
 *
 *  @returns void
 */
void hal_rtl_sport_set_rx_fifo_intr(hal_sport_adapter_t *psport_adapter, hal_sport_rx_fifo_intr_t *prx_fifo_intr)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;

	temp_reg &= ~(SPORT_BIT_SP_RX_FIFO_EMPTY_1_EN | SPORT_BIT_SP_RX_FIFO_FULL_INTR_1_EN | SPORT_BIT_SP_RX_FIFO_TH_INTR_1_EN);
	temp_reg &= ~(SPORT_BIT_SP_RX_FIFO_EMPTY_0_EN | SPORT_BIT_SP_RX_FIFO_FULL_INTR_0_EN | SPORT_BIT_SP_RX_FIFO_TH_INTR_0_EN);

	temp_reg |= (prx_fifo_intr->sport_empty_rx1 << SPORT_SHIFT_SP_RX_FIFO_EMPTY_1_EN);
	temp_reg |= (prx_fifo_intr->sport_full_rx1 << SPORT_SHIFT_SP_RX_FIFO_FULL_INTR_1_EN);
	temp_reg |= (prx_fifo_intr->sport_th_rx1 << SPORT_SHIFT_SP_RX_FIFO_TH_INTR_1_EN);

	temp_reg |= (prx_fifo_intr->sport_empty_rx0 << SPORT_SHIFT_SP_RX_FIFO_EMPTY_0_EN);
	temp_reg |= (prx_fifo_intr->sport_full_rx0 << SPORT_SHIFT_SP_RX_FIFO_FULL_INTR_0_EN);
	temp_reg |= (prx_fifo_intr->sport_th_rx0 << SPORT_SHIFT_SP_RX_FIFO_TH_INTR_0_EN);

	psport_reg->SPORT_SP_FIFO_INTR_CON = temp_reg;

}


/**
 *  @brief Set DMA parameters
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] page_size Set the page size.
 *  @param[in] page_num Set page numbers.
 *
 *  @returns void
 */
void hal_rtl_sport_dma_params(hal_sport_adapter_t *psport_adapter, u16 page_size, sport_page_num page_num)
{

	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_DMA_CON;
	temp_reg &= ~(SPORT_MASK_SP_PAGE_SIZE | SPORT_MASK_SP_PAGE_NUM);
	temp_reg |= (page_size << SPORT_SHIFT_SP_PAGE_SIZE) | (page_num << SPORT_SHIFT_SP_PAGE_NUM);
	psport_reg->SPORT_SP_DMA_CON = temp_reg;

	psport_adapter->init_dat.sport_data_byte_cnt = (u32)((page_num + 1) * ((page_size + 1) << 2));

	if (psport_adapter->init_dat.sport_tx0_data) {
		psport_reg->SPORT_SP_TX0_DMA_PP = (u32)psport_adapter->init_dat.sport_tx0_data;
	}

	if (psport_adapter->init_dat.sport_rx0_data) {
		psport_reg->SPORT_SP_RX0_DMA_PP = (u32)psport_adapter->init_dat.sport_rx0_data;

		if (psport_adapter->dcache_memory_en == 1) {
			if (psport_adapter->dcache_clean_by_addr != NULL) {
				psport_adapter->dcache_clean_by_addr((uint32_t *)psport_reg->SPORT_SP_RX0_DMA_PP, (int32_t) psport_adapter->init_dat.sport_data_byte_cnt);
			} else {
				DBG_SPORT_WARN(" psport_adapter->dcache_clean_by_addr is null \r\n");
			}
		}

	}

	if (psport_adapter->init_dat.sport_tx1_data) {
		psport_reg->SPORT_SP_TX1_DMA_PP = (u32)psport_adapter->init_dat.sport_tx1_data;
	}

	if (psport_adapter->init_dat.sport_rx1_data) {
		psport_reg->SPORT_SP_RX1_DMA_PP = (u32)psport_adapter->init_dat.sport_rx1_data;

		if (psport_adapter->dcache_memory_en == 1) {
			if (psport_adapter->dcache_clean_by_addr != NULL) {
				psport_adapter->dcache_clean_by_addr((uint32_t *)psport_reg->SPORT_SP_RX1_DMA_PP, (int32_t) psport_adapter->init_dat.sport_data_byte_cnt);
			} else {
				DBG_SPORT_WARN(" psport_adapter->dcache_clean_by_addr is null \r\n");
			}
		}

	}

}

/**
 *  @brief Control TX Start.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_start(hal_sport_adapter_t *psport_adapter, BOOL en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;
	uint8_t ctrl_1, ctrl_2;

	if (en == 0) {
		ctrl_1 = 1;
		ctrl_2 = 0;
	} else {
		ctrl_1 = 0;
		ctrl_2 = 1;
	}

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_DISABLE | SPORT_BIT_SP_START_TX);
	temp_reg |= (ctrl_1 << SPORT_SHIFT_SP_TX_DISABLE) | (ctrl_2 << SPORT_SHIFT_SP_START_TX);
	psport_reg->SPORT_SP_CON = temp_reg;

}

/**
 *  @brief Control RX Start.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_start(hal_sport_adapter_t *psport_adapter, BOOL en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;
	uint8_t ctrl_1, ctrl_2;

	if (en == 0) {
		ctrl_1 = 1;
		ctrl_2 = 0;
	} else {
		ctrl_1 = 0;
		ctrl_2 = 1;
	}

	temp_reg = psport_reg->SPORT_SP_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_DISABLE | SPORT_BIT_SP_START_RX);
	temp_reg |= (ctrl_1 << SPORT_SHIFT_SP_RX_DISABLE) | (ctrl_2 << SPORT_SHIFT_SP_START_RX);
	psport_reg->SPORT_SP_CON = temp_reg;

}

/**
 *  @brief Control TX DMA Start.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_sport_tx_dma_start(hal_sport_adapter_t *psport_adapter, BOOL en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_DMA_CON;
	temp_reg &= ~(SPORT_BIT_SP_TX_DMA_EN);
	temp_reg |= (en << SPORT_SHIFT_SP_TX_DMA_EN);
	psport_reg->SPORT_SP_DMA_CON = temp_reg;
}

/**
 *  @brief Get TX DMA Start Status.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
u32 hal_rtl_sport_get_tx_dma_start_sta(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return ((psport_reg->SPORT_SP_DMA_CON & SPORT_BIT_SP_TX_DMA_EN) >> SPORT_SHIFT_SP_TX_DMA_EN);
}

/**
 *  @brief Control RX DMA Start.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] en Control the enable.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_dma_start(hal_sport_adapter_t *psport_adapter, BOOL en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_DMA_CON;
	temp_reg &= ~(SPORT_BIT_SP_RX_DMA_EN);
	temp_reg |= (en << SPORT_SHIFT_SP_RX_DMA_EN);
	psport_reg->SPORT_SP_DMA_CON = temp_reg;
}

/**
 *  @brief Get RX DMA Start Status.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
u32 hal_rtl_sport_get_rx_dma_start_sta(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return ((psport_reg->SPORT_SP_DMA_CON & SPORT_BIT_SP_RX_DMA_EN) >> SPORT_SHIFT_SP_RX_DMA_EN);
}

/**
 *  @brief Set sport DMA buffer.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] pbuf_params  Set DMA buffer inputs.
 *
 *  @returns void
 */
void hal_rtl_sport_dma_buffer(hal_sport_adapter_t *psport_adapter, hal_sport_buf_params_t *pbuf_params)
{
	u32 i;

	if ((pbuf_params->page_num < 2) || (pbuf_params->page_num > 4) || (pbuf_params->page_size < 8)) {
		DBG_SPORT_WARN("PageNum(%d) valid value is 2~4; PageSize(%d must > 8)\r\n", pbuf_params->page_num, pbuf_params->page_size);
		return;
	}

	psport_adapter->init_dat.sport_tx0_data = (u8 *)pbuf_params->tx0_buf;
	psport_adapter->init_dat.sport_rx0_data = (u8 *)pbuf_params->rx0_buf;

	psport_adapter->init_dat.sport_tx1_data = (u8 *)pbuf_params->tx1_buf;
	psport_adapter->init_dat.sport_rx1_data = (u8 *)pbuf_params->rx1_buf;

	hal_rtl_sport_dma_params(psport_adapter, (pbuf_params->page_size / 4 - 1), (pbuf_params->page_num - 1));

	for (i = 0; i < pbuf_params->page_num; i++) {
		psport_adapter->ptx0_page_list[i] = (u32 *)(pbuf_params->tx0_buf + ((pbuf_params->page_size) * i));
		psport_adapter->prx0_page_list[i] = (u32 *)(pbuf_params->rx0_buf + ((pbuf_params->page_size) * i));
		psport_adapter->ptx1_page_list[i] = (u32 *)(pbuf_params->tx1_buf + ((pbuf_params->page_size) * i));
		psport_adapter->prx1_page_list[i] = (u32 *)(pbuf_params->rx1_buf + ((pbuf_params->page_size) * i));
	}

