Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
}

/**
 *  @brief Get the current tx0 page address.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns The address of current tx0 page or NULL.
 */
int *hal_rtl_sport_get_tx0_page(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 reg = 0;
	u8 sport_tx0_idx = psport_adapter->init_dat.sport_tx0_idx;

	switch (sport_tx0_idx) {

	case 0:
		reg = (psport_reg->SPORT_SP_TX_PAGE_OWN & SPORT_BIT_SP_TX0_P0OWN) >> SPORT_SHIFT_SP_TX0_P0OWN;
		break;

	case 1:
		reg = (psport_reg->SPORT_SP_TX_PAGE_OWN & SPORT_BIT_SP_TX0_P1OWN) >> SPORT_SHIFT_SP_TX0_P1OWN;
		break;

	case 2:
		reg = (psport_reg->SPORT_SP_TX_PAGE_OWN & SPORT_BIT_SP_TX0_P2OWN) >> SPORT_SHIFT_SP_TX0_P2OWN;
		break;

	case 3:
		reg = (psport_reg->SPORT_SP_TX_PAGE_OWN & SPORT_BIT_SP_TX0_P3OWN) >> SPORT_SHIFT_SP_TX0_P3OWN;
		break;

	default:
		DBG_SPORT_WARN("hal_sport_get_tx0_page, sport_tx0_idx: %d is illegal \r\n", sport_tx0_idx);
		break;

	}

	if (reg == 0) {
		// Cpu control
		return ((int *)psport_adapter->ptx0_page_list[sport_tx0_idx]);
	} else {
		// SPORT controller control
		DBG_SPORT_WARN("Tx_0_page is busy: \r\n");
		DBG_SPORT_WARN("page_idx: %d \r\n", sport_tx0_idx);
		return NULL;
	}

}

/**
 *  @brief Get the current tx1 page address.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns The address of current tx1 page or NULL.
 */
int *hal_rtl_sport_get_tx1_page(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 reg = 0;
	u8 sport_tx1_idx = psport_adapter->init_dat.sport_tx1_idx;

	switch (sport_tx1_idx) {

	case 0:
		reg = (psport_reg->SPORT_SP_TX_PAGE_OWN & SPORT_BIT_SP_TX1_P0OWN) >> SPORT_SHIFT_SP_TX1_P0OWN;
		break;

	case 1:
		reg = (psport_reg->SPORT_SP_TX_PAGE_OWN & SPORT_BIT_SP_TX1_P1OWN) >> SPORT_SHIFT_SP_TX1_P1OWN;
		break;

	case 2:
		reg = (psport_reg->SPORT_SP_TX_PAGE_OWN & SPORT_BIT_SP_TX1_P2OWN) >> SPORT_SHIFT_SP_TX1_P2OWN;
		break;

	case 3:
		reg = (psport_reg->SPORT_SP_TX_PAGE_OWN & SPORT_BIT_SP_TX1_P3OWN) >> SPORT_SHIFT_SP_TX1_P3OWN;
		break;

	default:
		DBG_SPORT_WARN("hal_sport_get_tx1_page, sport_tx1_idx: %d is illegal \r\n", sport_tx1_idx);
		break;

	}

	if (reg == 0) {
		// Cpu control
		return ((int *)psport_adapter->ptx1_page_list[sport_tx1_idx]);
	} else {
		// SPORT controller control
		DBG_SPORT_WARN("Tx_1_page is busy: \r\n");
		DBG_SPORT_WARN("page_idx: %d \r\n", sport_tx1_idx);
		return NULL;
	}

}

/**
 *  @brief Sets current tx0 page own by SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] pbuf  Set tx buffer adderss.
 *
 *  @returns void
 */
void hal_rtl_sport_tx0_page_send(hal_sport_adapter_t *psport_adapter, u32 *pbuf)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 page_num, i;
	u8 sport_tx0_idx = psport_adapter->init_dat.sport_tx0_idx;
	u8 sport_page_num = (psport_reg->SPORT_SP_DMA_CON & SPORT_MASK_SP_PAGE_NUM) >> SPORT_SHIFT_SP_PAGE_NUM;

	page_num = sport_page_num + 1;
	for (i = 0; i < page_num; i++) {

		if (psport_adapter->ptx0_page_list[i] == pbuf) {

			if (sport_tx0_idx != i) {
				DBG_SPORT_WARN("hal_sport_tx0_page_send: UnExpected Page Index. TxPage=%d, Expected:%d\r\n",
							   i, sport_tx0_idx);
			}

			if (psport_adapter->dcache_memory_en == 1) {
				if (psport_adapter->dcache_clean_by_addr != NULL) {
					psport_adapter->dcache_clean_by_addr((uint32_t *)psport_adapter->ptx0_page_list[i],
														 (int32_t)((((psport_reg->SPORT_SP_DMA_CON & SPORT_MASK_SP_PAGE_SIZE) >> SPORT_SHIFT_SP_PAGE_SIZE) + 1) << 2));
				} else {
					DBG_SPORT_WARN(" psport_adapter->dcache_clean_by_addr is null \r\n");
				}
			}

			switch (i) {

			case 0:
				psport_reg->SPORT_SP_TX_PAGE_OWN |= SPORT_BIT_SP_TX0_P0OWN;
				break;

			case 1:
				psport_reg->SPORT_SP_TX_PAGE_OWN |= SPORT_BIT_SP_TX0_P1OWN;
				break;

			case 2:
				psport_reg->SPORT_SP_TX_PAGE_OWN |= SPORT_BIT_SP_TX0_P2OWN;
				break;

			case 3:
				psport_reg->SPORT_SP_TX_PAGE_OWN |= SPORT_BIT_SP_TX0_P3OWN;
				break;

			default:
				DBG_SPORT_WARN("hal_sport_tx0_page_send, page_idx: %d is illegal \r\n", i);
				break;

			}

			sport_tx0_idx = i + 1;
			if (sport_tx0_idx > sport_page_num) {
				sport_tx0_idx = 0;
			}
			psport_adapter->init_dat.sport_tx0_idx = sport_tx0_idx;

			break;  // break the for loop
		}
	}

	if (i == page_num) {
		DBG_SPORT_WARN("sport_tx0_page_send: the pbuf(0x%x) is not a DMA buffer\r\n", pbuf);
	}

}

/**
 *  @brief Sets current tx1 page own by SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] pbuf  Set tx buffer adderss.
 *
 *  @returns void
 */
void hal_rtl_sport_tx1_page_send(hal_sport_adapter_t *psport_adapter, u32 *pbuf)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u8 page_num, i;
	u8 sport_tx1_idx = psport_adapter->init_dat.sport_tx1_idx;
	u8 sport_page_num = (psport_reg->SPORT_SP_DMA_CON & SPORT_MASK_SP_PAGE_NUM) >> SPORT_SHIFT_SP_PAGE_NUM;

	page_num = sport_page_num + 1;
	for (i = 0; i < page_num; i++) {

		if (psport_adapter->ptx1_page_list[i] == pbuf) {

			if (sport_tx1_idx != i) {
				DBG_SPORT_WARN("hal_sport_tx1_page_send: UnExpected Page Index. TxPage=%d, Expected:%d\r\n",
							   i, sport_tx1_idx);
			}

			if (psport_adapter->dcache_memory_en == 1) {
				if (psport_adapter->dcache_clean_by_addr != NULL) {
					psport_adapter->dcache_clean_by_addr((uint32_t *)psport_adapter->ptx1_page_list[i],
														 (int32_t)((((psport_reg->SPORT_SP_DMA_CON & SPORT_MASK_SP_PAGE_SIZE) >> SPORT_SHIFT_SP_PAGE_SIZE) + 1) << 2));
				} else {
					DBG_SPORT_WARN(" psport_adapter->dcache_clean_by_addr is null \r\n");
				}
			}

			switch (i) {

			case 0:
				psport_reg->SPORT_SP_TX_PAGE_OWN |= SPORT_BIT_SP_TX1_P0OWN;
				break;

			case 1:
				psport_reg->SPORT_SP_TX_PAGE_OWN |= SPORT_BIT_SP_TX1_P1OWN;
				break;

			case 2:
				psport_reg->SPORT_SP_TX_PAGE_OWN |= SPORT_BIT_SP_TX1_P2OWN;
				break;

			case 3:
				psport_reg->SPORT_SP_TX_PAGE_OWN |= SPORT_BIT_SP_TX1_P3OWN;
				break;

			default:
				DBG_SPORT_WARN("hal_sport_tx1_page_send, page_idx: %d is illegal \r\n", i);
				break;

