Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sport.c
			}

			sport_tx1_idx = i + 1;
			if (sport_tx1_idx > sport_page_num) {
				sport_tx1_idx = 0;
			}
			psport_adapter->init_dat.sport_tx1_idx = sport_tx1_idx;

			break;  // break the for loop
		}
	}

	if (i == page_num) {
		DBG_SPORT_WARN("sport_tx1_page_send: the pbuf(0x%x) is not a DMA buffer\r\n", pbuf);
	}

}

/**
 *  @brief Sets current rx0 page own by SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
u32 hal_rtl_sport_rx0_page_recv(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 reg = 0;
	u8 sport_rx0_idx = psport_adapter->init_dat.sport_rx0_idx;
	u8 sport_page_num = (psport_reg->SPORT_SP_DMA_CON & SPORT_MASK_SP_PAGE_NUM) >> SPORT_SHIFT_SP_PAGE_NUM;

	switch (sport_rx0_idx) {

	case 0:
		reg = (psport_reg->SPORT_SP_RX_PAGE_OWN & SPORT_BIT_SP_RX0_P0OWN) >> SPORT_SHIFT_SP_RX0_P0OWN;
		break;

	case 1:
		reg = (psport_reg->SPORT_SP_RX_PAGE_OWN & SPORT_BIT_SP_RX0_P1OWN) >> SPORT_SHIFT_SP_RX0_P1OWN;
		break;

	case 2:
		reg = (psport_reg->SPORT_SP_RX_PAGE_OWN & SPORT_BIT_SP_RX0_P2OWN) >> SPORT_SHIFT_SP_RX0_P2OWN;
		break;

	case 3:
		reg = (psport_reg->SPORT_SP_RX_PAGE_OWN & SPORT_BIT_SP_RX0_P3OWN) >> SPORT_SHIFT_SP_RX0_P3OWN;
		break;

	default:
		DBG_SPORT_WARN("hal_sport_rx0_page_recv, sport_rx0_idx: %d is illegal \r\n", sport_rx0_idx);
		break;

	}

	if (reg != 0) {
		DBG_SPORT_WARN("hal_sport_rx0_page_recv: No Idle Rx Page\r\n");
		return HAL_NOT_READY;
	}

	switch (sport_rx0_idx) {

	case 0:
		psport_reg->SPORT_SP_RX_PAGE_OWN |= SPORT_BIT_SP_RX0_P0OWN;
		break;

	case 1:
		psport_reg->SPORT_SP_RX_PAGE_OWN |= SPORT_BIT_SP_RX0_P1OWN;
		break;

	case 2:
		psport_reg->SPORT_SP_RX_PAGE_OWN |= SPORT_BIT_SP_RX0_P2OWN;
		break;

	case 3:
		psport_reg->SPORT_SP_RX_PAGE_OWN |= SPORT_BIT_SP_RX0_P3OWN;
		break;

	default:
		DBG_SPORT_WARN("hal_sport_rx0_page_recv, sport_rx0_idx: %d is illegal \r\n", sport_rx0_idx);
		break;

	}

	sport_rx0_idx = sport_rx0_idx + 1;
	if (sport_rx0_idx > sport_page_num) {
		sport_rx0_idx = 0;
	}
	psport_adapter->init_dat.sport_rx0_idx = sport_rx0_idx;

	return HAL_OK;

}

/**
 *  @brief Sets current rx1 page own by SPORT.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
u32 hal_rtl_sport_rx1_page_recv(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 reg = 0;
	u8 sport_rx1_idx = psport_adapter->init_dat.sport_rx1_idx;
	u8 sport_page_num = (psport_reg->SPORT_SP_DMA_CON & SPORT_MASK_SP_PAGE_NUM) >> SPORT_SHIFT_SP_PAGE_NUM;

	switch (sport_rx1_idx) {

	case 0:
		reg = (psport_reg->SPORT_SP_RX_PAGE_OWN & SPORT_BIT_SP_RX1_P0OWN) >> SPORT_SHIFT_SP_RX1_P0OWN;
		break;

	case 1:
		reg = (psport_reg->SPORT_SP_RX_PAGE_OWN & SPORT_BIT_SP_RX1_P1OWN) >> SPORT_SHIFT_SP_RX1_P1OWN;
		break;

	case 2:
		reg = (psport_reg->SPORT_SP_RX_PAGE_OWN & SPORT_BIT_SP_RX1_P2OWN) >> SPORT_SHIFT_SP_RX1_P2OWN;
		break;

	case 3:
		reg = (psport_reg->SPORT_SP_RX_PAGE_OWN & SPORT_BIT_SP_RX1_P3OWN) >> SPORT_SHIFT_SP_RX1_P3OWN;
		break;

	default:
		DBG_SPORT_WARN("hal_sport_rx1_page_recv, sport_rx1_idx: %d is illegal \r\n", sport_rx1_idx);
		break;

	}

	if (reg != 0) {
		DBG_SPORT_WARN("hal_sport_rx1_page_recv: No Idle Rx Page\r\n");
		return HAL_NOT_READY;
	}

	switch (sport_rx1_idx) {

	case 0:
		psport_reg->SPORT_SP_RX_PAGE_OWN |= SPORT_BIT_SP_RX1_P0OWN;
		break;

	case 1:
		psport_reg->SPORT_SP_RX_PAGE_OWN |= SPORT_BIT_SP_RX1_P1OWN;
		break;

	case 2:
		psport_reg->SPORT_SP_RX_PAGE_OWN |= SPORT_BIT_SP_RX1_P2OWN;
		break;

	case 3:
		psport_reg->SPORT_SP_RX_PAGE_OWN |= SPORT_BIT_SP_RX1_P3OWN;
		break;

	default:
		DBG_SPORT_WARN("hal_sport_rx1_page_recv, sport_rx1_idx: %d is illegal \r\n", sport_rx1_idx);
		break;

	}

	sport_rx1_idx = sport_rx1_idx + 1;
	if (sport_rx1_idx > sport_page_num) {
		sport_rx1_idx = 0;
	}
	psport_adapter->init_dat.sport_rx1_idx = sport_rx1_idx;

	return HAL_OK;

}

/**
 *  @brief Get the error status of TX FIFO.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX FIFO error counts
 */
u32 hal_rtl_sport_get_tx_fifo_err(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = (psport_reg->SPORT_SP_TX_RX_ERR_STA & SPORT_MASK_SP_TX_ERR_CNT) >> SPORT_SHIFT_SP_TX_ERR_CNT;

	return temp_reg;

}

/**
 *  @brief Get the error status of RX FIFO.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns RX FIFO error counts
 */
u32 hal_rtl_sport_get_rx_fifo_err(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = (psport_reg->SPORT_SP_TX_RX_ERR_STA & SPORT_MASK_SP_RX_ERR_CNT) >> SPORT_SHIFT_SP_RX_ERR_CNT;

	return temp_reg;

}

/**
 *  @brief Clean the error status of TX FIFO.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_clr_tx_fifo_err(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_EN_CLK_CON |= SPORT_BIT_SP_CLEAR_TX_ERR_CNT;
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON &= ~(SPORT_BIT_SP_CLEAR_TX_ERR_CNT);

}

/**
 *  @brief Clean the error status of RX FIFO.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns void
 */
void hal_rtl_sport_clr_rx_fifo_err(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_EN_CLK_CON |= SPORT_BIT_SP_CLEAR_RX_ERR_CNT;
	psport_reg->SPORT_SP_FIFO_EN_CLK_CON &= ~(SPORT_BIT_SP_CLEAR_RX_ERR_CNT);

}

/**
 *  @brief Register the SPORT FIFO IRQ callback function and argument.
 *
 *  @param[in] pecdsa_adapter The SPORT adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @returns void
 */
void hal_rtl_sport_fifo_cb_handler(hal_sport_adapter_t *psport_adapter, sport_irq_user_cb_t callback, u32 *arg)
{
	if (callback != NULL) {
		psport_adapter->sport_irq_user_cb = callback;
		psport_adapter->sport_user_arg = arg;
	}
}

/**
 *  @brief Register the SPORT TX0 DMA IRQ callback function and argument.
 *
 *  @param[in] pecdsa_adapter The SPORT adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @returns void
 */
void hal_rtl_sport_tx0_dma_cb_handler(hal_sport_adapter_t *psport_adapter, sport_irq_user_cb_t callback, u32 *arg)
{
	if (callback != NULL) {
		psport_adapter->sport_tx0_irq_user_cb = callback;
		psport_adapter->sport_tx0_user_arg = arg;
	} else {
		psport_adapter->sport_tx0_irq_user_cb = NULL;
		psport_adapter->sport_tx0_user_arg = NULL;
	}
}

/**
 *  @brief Register the SPORT TX1 DMA IRQ callback function and argument.
 *
 *  @param[in] pecdsa_adapter The SPORT adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @returns void
 */
void hal_rtl_sport_tx1_dma_cb_handler(hal_sport_adapter_t *psport_adapter, sport_irq_user_cb_t callback, u32 *arg)
{
	if (callback != NULL) {
		psport_adapter->sport_tx1_irq_user_cb = callback;
		psport_adapter->sport_tx1_user_arg = arg;
	} else {
		psport_adapter->sport_tx1_irq_user_cb = NULL;
		psport_adapter->sport_tx1_user_arg = NULL;
	}
}

/**
 *  @brief Register the SPORT RX0 DMA IRQ callback function and argument.
 *
 *  @param[in] pecdsa_adapter The SPORT adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @returns void
 */
void hal_rtl_sport_rx0_dma_cb_handler(hal_sport_adapter_t *psport_adapter, sport_irq_user_cb_t callback, u32 *arg)
{
	if (callback != NULL) {
		psport_adapter->sport_rx0_irq_user_cb = callback;
		psport_adapter->sport_rx0_user_arg = arg;
	} else {
		psport_adapter->sport_rx0_irq_user_cb = NULL;
		psport_adapter->sport_rx0_user_arg = NULL;
	}
}

/**
 *  @brief Register the SPORT RX1 DMA IRQ callback function and argument.
 *
 *  @param[in] pecdsa_adapter The SPORT adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @returns void
 */
void hal_rtl_sport_rx1_dma_cb_handler(hal_sport_adapter_t *psport_adapter, sport_irq_user_cb_t callback, u32 *arg)
{
	if (callback != NULL) {
		psport_adapter->sport_rx1_irq_user_cb = callback;
		psport_adapter->sport_rx1_user_arg = arg;
	} else {
		psport_adapter->sport_rx1_irq_user_cb = NULL;
		psport_adapter->sport_rx1_user_arg = NULL;
	}
}

/**
 *  @brief Register the SPORT DMA error IRQ callback function and argument.
 *
 *  @param[in] pecdsa_adapter The SPORT adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @returns void
 */
void hal_rtl_sport_dma_err_cb_handler(hal_sport_adapter_t *psport_adapter, sport_irq_user_cb_t callback, u32 *arg)
{
	if (callback != NULL) {
		psport_adapter->sport_dma_err_irq_user_cb = callback;
		psport_adapter->sport_dma_err_user_arg = arg;
	} else {
		psport_adapter->sport_dma_err_irq_user_cb = NULL;
		psport_adapter->sport_dma_err_user_arg = NULL;
	}
}

/**
 *  @brief Set sport uses the fixed bclk.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] fixed_en: Control fixed bclk
 *  @param[in] fixed_bclk_sel: Select the fixed bclk frequence.
 *
 *  @returns void
 */
void hal_rtl_sport_fixed_bclk(hal_sport_adapter_t *psport_adapter, BOOL fixed_en, sport_fixed_bclk_t fixed_bclk_sel)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_FIXED_BCLK_SEL | SPORT_BIT_SP_FIXED_BCLK);
	temp_reg |= (fixed_en << SPORT_SHIFT_SP_FIXED_BCLK);
	temp_reg |= (fixed_bclk_sel << SPORT_SHIFT_SP_FIXED_BCLK_SEL);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}

/**
 *  @brief Set tx and rx are the same FS.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] en 1: Tx and rx are the same, 0: FS is not the same.
 *
 *  @returns void
 */
void hal_rtl_sport_rx_same_fs(hal_sport_adapter_t *psport_adapter, BOOL en)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	uint32_t temp_reg;

	temp_reg = psport_reg->SPORT_SP_FORM_CON;
	temp_reg &= ~(SPORT_BIT_SP_TRX_SAME_LRCK);
	temp_reg |= (en << SPORT_SHIFT_SP_TRX_SAME_LRCK);
	psport_reg->SPORT_SP_FORM_CON = temp_reg;
}


